[
{
"event_key": "tobedefined",
"active": "Y",
"name": "Des données réactives, du back au front !",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 1,
"venue_id": "tobedefined",
"speakers": "Luc Sorel, ",
"description": "Les canaux de données intégrables dans une application se diversifient - certains pouvant être peu prévisibles quant au rythme d'arrivée de valeurs (objets connectés) ou quant à la structure des données reçues (traçage d'événements utilisateurs : actions de clic, mesure de temps de consultation). Difficile de choisir une seule technologie pour gérer ces données dynamiques et l'application web ou mobile qui les valorisera.\n\nCet atelier propose une **approche microservices** sur un cas d'école (tableau de suivi de capteurs) pour *utiliser différentes technologies réactives* (Apache Spark, Reactive eXtensions, websockets) dans des composants \"métier\" indépendants et *les articuler avec Docker et ZeroMQ*. L'analyse de données et le serveur d'application sont libres d'évoluer à leur rythme et permettent d'**avoir des données réactives, du serveur au navigateur** !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Traefik, a modern reverse-proxy",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 4,
"venue_id": "tobedefined",
"speakers": "Emile Vauge, ",
"description": "Si je vous dis microservices, vous allez surement me répondre: Docker, Mesos, Consul, Etcd... Et l'intégration d'un reverse-proxy / load-balancer dans tout ça? Pas simple... Et si on créait un reverse-proxy \"automatique\"?\n[Traefik](http://traefik.io) est un reverse-proxy, load-balancer dynamique, permettant de construire sa configuration à chaud à partir de différents bakends : Docker, Mesos/Marathon, Etcd, Consul, Zookeeper, BoltDb…"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Un monde sans Javascript ?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 9,
"venue_id": "tobedefined",
"speakers": "Vincent Ogloblinsky, Matthieu Bréchet",
"description": "Dans un pays totalitaire d’Asie orientale de plus de 100 millions d’habitants, une vague de hacking sans précédent secoue tout le pays et plus particulièrement les infrastructures nationales.\nLes vilains petits hackeurs ont profité d’une faille JS et du parc de navigateurs internet non à jour pour sévir.\n\nAprès quelques jours de silence, le gouvernement condamne fermement cette attaque et décide d’imposer dorénavant un navigateur “officiel” sans le moindre moteur Javascript dans tout le pays.\nL’ensemble des sites des navigateurs alternatifs sont bloqués par le proxy interne au pays.\n\nDe l’autre côté de l’océan pacifique, la plupart des entreprises proposant des services “gratuits” à très grand échelle sont face à un dilemme.\nQue faire face à cette situation qui leur impose un grand retour en arrière technologique ?\nDoit-on sacrifier l’expérience utilisateur au détriment d’un service dégradé mais disponible ?\n\nQuelles solutions techniques ont-elles à disposition à l’heure actuelle ?\nQuel choix vont-elles faire ?\nComment va réagir la population ?\n\nEn parallèle de cette histoire, une réflexion sur le monde du développement web “frontend” d’hier, d’aujourd’hui et de demain sera enrichie de divers exemples de solutions techniques, pistes et réflexions."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "WebVR - La réalité virtuelle va-t-elle décoller ?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 10,
"venue_id": "tobedefined",
"speakers": "Vincent Ogloblinsky, ",
"description": "La réalité augmentée sera-t-elle le nouveau média/support à la mode dans les prochaines années à en croire le gros chèque de 2 milliards de $ fait par Facebook pour acheter la société Oculus VR en mars 2014.\n\nLe monde du développement web se charge en parallèle de mettre en place une norme dans les navigateurs web afin de proposer nativement ce format.\n\nOù en sont les fournisseurs de navigateurs internet sur la mise en place de la norme ?\nQuelles autres solutions tierces existent à l’heure actuelle ?\nQuelles expériences innovantes et originales pouvons-nous proposer actuellement ?\n\nAu travers de quelques démos, venez découvrir ce qui ce cache techniquement derrière le buzzword de 2015."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Développer un Web Service Géospatial avec Kotlin et Spring Boot",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 13,
"venue_id": "tobedefined",
"speakers": "Sébastien Deleuze, ",
"description": "Au travers d’une application de chat géolocalisée dont les données proviennent d'[OpenStreetMap](http://openstreetmap.fr/) et permettant de discuter avec les personnes situées à proximité, je montrerai comment l’utilisation combinée de [Kotlin](https://kotlinlang.org/) et de [Spring Boot](http://projects.spring.io/spring-boot/) permet de développer simplement et élégamment des applications puissantes.\n\nCe sera également l’occasion de montrer l’utilisation d’une base de donnée relationnelle avec Spring DATA mais SANS JPA via le module [spring-data-jdbc-repository](https://github.com/nurkiewicz/spring-data-jdbc-repository) afin d'utiliser simplement les fonctionnalités de PostgreSQL telles que son cartouche géographique PostGIS ou le support JSON natif tout en gardant une stack technologique légère et optimisée. La libraries [Exposed](https://github.com/JetBrains/Exposed) qui est une DSL SQL Kotlin sera utilisée pour faire du code SQL statiquement typé.\n\nLes aspects suivants de Kotlin seront abordés de manière concrète avec de nombreux exemples de code tirés de cette application:\n- Inférence de type surpuissante pour du code conçus et 0 overhead\n- Excellente interopérabilité Java\n- Sureté du code, via une meilleur prise en charge des valeurs null\n- Rapide à écrire, facile à lire"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Pimp your Element ! (Polymer)",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 14,
"venue_id": "tobedefined",
"speakers": "Cedric Le Gallo, ",
"description": "“There is an element for that” est l’une des catchphrase de Polymer, et effectivement, son catalogue est riche en composants. Iron, Paper, Neon et les autres animent déjà notre quotidien d’apprenti joueurs de lego, mais que faire quand un composant ne rend pas exactement le service que l’on souhaite ? Existe-t-il une alternative au bon vieu “Do it yourself” ? Dans ce talk, je vais vous présenter les différents moyen de customisation graphique et fonctionnelle que Polymer nous offre pour ses elements."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Déploiement d'appliance réseau en mode plug&play avec Ansible et FreeBSD",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 15,
"venue_id": "tobedefined",
"speakers": "Olivier Cochard-Labbé, ",
"description": "Comment un administrateur réseau, très fainéant et radin, peut-il faire pour déployer dans le monde entier des appliances réseau (Routeur VPN, firewalls, access-point wifi, portail captif, IDPS, switchs, etc...) le plus facilement possible."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Route vers une infrastructure en temps que code",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 16,
"venue_id": "tobedefined",
"speakers": "Quentin Nerden, ",
"description": "L'infrastructure en temps que code:\nMigration depuis des serveurs physiques et locaux gérés presque manuellement vers une architecture sur AWS crée automatiquement à partir de commits git, à Stylight GmbH.\nExemple: déploiement de serveurs Solr.\nComment partir de Fabric et Puppet et migrer version une utilisation de Cloudformation."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Server Rendering avec Angular 2",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 17,
"venue_id": "tobedefined",
"speakers": "Wassim Chegham, ",
"description": "Ce tools in action est une introduction du projet Angular 2 Universal. Ce projet ajoute le support du server rendering à vos applications Angular 2. En d'autres termes,  avec Angular Universal il sera possible d'éxecuter une même application Angular 2 côté client et côté serveur."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Please welcome Angular 2",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 18,
"venue_id": "tobedefined",
"speakers": "Wassim Chegham, ",
"description": "Salut à toi développeur(se) JavaScript, as-tu entendu parler d'Angular 2 ? C'est une nouvelle version du framework AngularJS entièrement repensée : plus de contrôleurs, plus de services ou de factories ; à dieu les DDO, $compile et link(). Si tu veux en savoir plus, viens découvrir des concepts plus simples, une nouvelle syntaxe ES6, une architecture FLUX, du rendu côté serveur, un CLI...et plein d'autres nouveautés. Alors, prêt(e) pour une nouvelle aventure ?"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Angular 2 Getting Started",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 19,
"venue_id": "tobedefined",
"speakers": "Wassim Chegham, ",
"description": "Tu as entendu tout le monde parler d'Angular 2 mais tu n'as pas eu le temps de mettre les mains dans le code. Alors, retrousse tes manches et rejoins-nous dans ce hands on consacré à la découverte du monde merveilleux d'Angular 2."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "You want dashboards for all, you got it",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 20,
"venue_id": "tobedefined",
"speakers": "Abdellatif Bouchama, ",
"description": "Tous les projets stratégiques ont besoin de gestion et de surveillance, et les questions qui se posent souvent:\n\n-?\tComment puis-je visualiser la santé de ma plate-forme?\n-?\tComment puis-je analyser les données de mes applications?\n-?\tComment puis-je visualiser la performance de l'entreprise et la part des objectifs atteints?\n\nDans cette présentation, nous allons voir comment nous pouvons répondre à ces questions et donner des tableaux de bord spécifiques fondés sur un ensemble de produits open source qui permettent de centraliser et d'analyser des données de votre SI en temps réel, sans nécessairement changé à chaque fois le système existant mais plutôt, comment il peut bénéficier et lui donner de la valeur ajoutée grâce à cette nouvelle technologie."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Introduction à Apache Zeppelin",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 21,
"venue_id": "tobedefined",
"speakers": "Bruno Bonnin, ",
"description": "Zeppelin est un projet (Apache Incubator) dont le but est de fournir un environnement facilitant la découverte, l'analyse et le partage de données. Ses principales caractéristiques sont :\n* accès via un navigateur,\n* création de notes où de multiples interpréteurs permettent d'accéder à différentes sources de données (Cassandra, Postgresql, Elasticsearch, ...) et de définir des traitements sur celles-ci (avec Spark, Flink, ...)\n* visualisation des données brutes et des résultats de traitements (mode texte ou graphiques)\n* partage des notes\n\nPartons à la découverte de ce projet d'avenir de la fondation Apache."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Guider son Sphero avec l'API Web Bluetooth LE",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": " Objects connectés, IoT, Robotique",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 22,
"venue_id": "tobedefined",
"speakers": "Bruno Bonnin, ",
"description": "L'API web Bluetooth Low Energy permet de facilement dialoguer avec des objets dans l'environnement de notre navigateur. Partons à la découverte de cette API à travers la construction d'une application web permettant d'interagir avec le robot Ollie de Sphero."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Docker pour les dévs .NET : De l'env de dév à l'env de prod",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 24,
"venue_id": "tobedefined",
"speakers": "Vincent Lainé, ",
"description": "Cette présentation à pour but de montrer les différentes possibilités d'intégration de Docker dans l'environnement de développement MS de 2015. Nous nous placerons dans la peau d'un dév(ops) .NET et nous verrons comment docker peut être intégré pour le débug, le test et enfin la mise en production."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Mais bordel pourquoi on ne m'écoute pas !",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 25,
"venue_id": "tobedefined",
"speakers": "Timothée Chevrier, ",
"description": "En écho au sublime et fantastique trailer du BreizhCamp, je propose un autre regard sur ces situations où les techniques se sentent incompris, non écoutés par rapport aux managers et commerciaux.\nGandhi nous dit : \"Sois le changement que tu veux voir dans le monde\". \nMon idée principale est donc qu'on ne peut pas changer les autres et qu'il est plus simple de changer soi même. \nJe propose de balayer plusieurs concepts d'analyse de la relation humaine (cadres de référence, modèle parent/adulte/enfant, position de vie, communication non violente) dans le but de mieux comprendre ce qui ce joue chez les individus lors d'une communication. J'aborderais au passage la nécessité de remettre l'adulte aux commandes, càd démarrer par les faits et rien que les faits pour ensuite laisser place aux ressentis, à l'intuition et pourquoi pas aux émotions.\nJ'essaierais en parallèle d'illustrer l'utilité de ces notions à travers un cas imaginaire (discussion sur un choix technique, échanges lors d'un lancement projet, autre situation parlante ?). Pourquoi pas reprendre la vidéo et inventer un scénario différent ?\nJ'espère pouvoir garder un temps d'échange relativement important : 15min serait pas mail."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Design de la data :",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 26,
"venue_id": "tobedefined",
"speakers": "Michel Rousseau, ",
"description": "Lancer vous dans le design de data, en tirant parti des leçons des trois grandes plateformes (Android, Apple et WIndows), en utilisant de nouveaux modèles (PowerBI, web, jeu vidéo) et en utilisant des patterns trendy !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Orchestration de Docker sur AWS",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 27,
"venue_id": "tobedefined",
"speakers": "Julien Simon, ",
"description": "AWS a lancé EC2 Container Service (ECS), qui permet d'exécuter et de gérer aisément des containers Docker sur un cluster d'instances Amazon EC2. Au fil de cette présentation technique centrée sur l¹utilisation réelle d'ECS, nous aborderons les points suivants :\n\n* Pourquoi utiliser un orchestrateur de containers ?\n* Principales fonctionnalités d¹ECS : création et scaling du cluster, déploiement des tâches, versioning, etc.\n* Utiliser ECS avec la console AWS et la ligne de commande (\"aws\" et \"ecs-cli\")\n* Intégrer ECS dans une architecture micro-services : service discovery et load balancing avec Consul, Registrator et Fabio\n* Étude de cas clients : Remind (qui a migré de Heroku vers ECS), Coursera ou Meteor.js (qui a choisi ECS face à Kubernetes)"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Connectez vos objets au Cloud avec AWS IoT",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": " Objects connectés, IoT, Robotique",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 28,
"venue_id": "tobedefined",
"speakers": "Julien Simon, ",
"description": "AWS a lancé AWS IoT, une plate-forme qui vous permet de connecter vos objets aux services AWS et à d'autres objets. Au fil de cette présentation technique centrée sur l¹utilisation réelle d'AWS IoT, nous aborderons les points suivants :\n* Principales fonctionnalités d'AWS IoT : configuration, connection à la plate-forme, confidentialité, messaging avec MQTT, publish/subscribe, etc.\n* Démonstration d'une application de détection d'incendie, basée sur des Arduino Yun connectés et sur une appli web.\n* Traitement des données issues des objets avec AWS Lambda et Amazon DynamoDB\n* Cas clients"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Algorithmes distribués pour le Big Data, saison 2",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 29,
"venue_id": "tobedefined",
"speakers": "DuyHai DOAN, ",
"description": "Vous avez aimé la première saison des algorithmes pour le Big Data avec **HyperLogLog** et **Paxos** ? La saison 2 est là et vous propose au menu 1 structure de donnée et un algorithme tout frais sorti des publications universitaires.\n\nCréer une structure de données qui supporte des opérations distribuées sans coordination relève d'une gageure. Mais **Marc Shapiro** a relevé le défi avec les **CRDT**! Nous allons voir comment, sous réserve de respecter quelques propriétés, on peut obtenir une convergence des données distribuées sans besoin de recourir à un lock global.\n\nExécuter des opérations de manière _atomique_ sur des architectures distribuées est  théoriquement impossible sans coordination globale (donc quelque part un lock global). Par contre, il est possible d'obtenir une **visibilité atomique** sans coordination avec l'algorithme **RAMP Transaction** présenté par **Peter Bailis** en 2014. Cet algorithme ouvre la porte à des perspectives intéressantes pour des besoins comme des indexes distribués etc..\n\n Comme toujours, chaque structure/algorithme sera présenté avec une implémentation concrète pour mieux illustrer les cas d'utilisation."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Apache Zeppelin, un notebook d'avenir pour l'éco-système Big Data",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 30,
"venue_id": "tobedefined",
"speakers": "DuyHai DOAN, ",
"description": "**Spark** et **Cassandra** sont des projets très populaires, mais avez vous entendu parler d'**Apache Zeppelin** ? **Zeppelin** propose un système de notebook pour pouvoir manipuler les données de manière interactive. **Zeppelin** repose sur un système de plugins qui permet de traiter des tâches **Spark**, des requêtes **Spark SQL** mais aussi des requêtes **CQL** de **Cassandra**. \n\n Je montrerai comment construire un pipeline de transformation BigData en mélangeant du Spark, du Cassandra, du Shell, du Markdown, du _ce-que-vous-voulez_ etc.\n\n**Votre framework préféré n'a pas encore de plugin pour Zeppelin ? Ecrivez-en un et partager le avec la communauté!**"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Les user-defined functions et vues matérialisées dans Cassandra 3.0",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 31,
"venue_id": "tobedefined",
"speakers": "DuyHai DOAN, ",
"description": "Cassandra évolue à vitesse grand V et propose de plus en plus de fonctionnalités qui le rapproche du monde SQL, mais toujours avec une approche distribuée.\n\nD'abord, nous regarderons du côté des **user-defined functions** introduits récemment et montrer comment ils peuvent améliorer la performance des vos applications et enrichir les use-case **Analytics**.\n\nEnsuite, un petit passage sur les **vues matérialisées**, fonctionnalité majeure s'il en est, qui vont changer drastiquement la façon de modéliser ses données dans **Cassandra** et vous simplifier la vie, à vous _développeurs_!"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "SEO & WebComponent",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 32,
"venue_id": "tobedefined",
"speakers": "Cedric Le Gallo, ",
"description": "Le shadow-dom est une invention géniale. Apporter l'encapsulation DOM dans le navigateur est une excellente idée pour tous les développeurs de France, de Navarre et d'ailleurs. Cependant après le célébrissime \"comment référencer ma SPA ?\" un nouveau chapitre de la saga  SEO s'ouvre sur l'univers Webtastique. En effet si le contenu de nos applications se cache dans les ténèbres, personne ne saura le retrouver correctement. Pas même Goo Glee et son surpuissant Robot de crawl. Heureusement, la résistance s'organise déjà et fabrique un immense projecteur pour révéler vos contenus cachés dans l'ombre, sur demande.  Venez donc découvrir ce projecteur en 15 minutes !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "La face cachée des assistants virtuels",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 34,
"venue_id": "tobedefined",
"speakers": "Matthieu Bréchet, ",
"description": "Les assistants virtuels sont de plus en plus intelligents et présents partout, dans nos téléphones, nos pcs, parfois même de manière insoupçonnée.\n\nNe vous êtes vous jamais demandé comment font ces systèmes pour en apprendre de plus en plus sur notre comportement ?\n\nL’idée de ce tool in action est d’en démystifier leur fonctionnement à travers la présentation d’un assistant intelligent open source équivalent à ce que peu faire Apple avec Siri.\n\nOn discutera de réseau neuronal, un peu de math, mais aussi de HTML5, reconnaissance vocale, Javascript,  NodeJs et à la fin de cette session vous aurez découvert une nouvelle façon d'interagir avec votre ordinateur."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Game Over",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": " Objects connectés, IoT, Robotique",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 35,
"venue_id": "tobedefined",
"speakers": "jean-francois garreau, ",
"description": "Vous incarnez DevLink, un développeur à la recherche de la balise perdue ! La légende raconte que cette balise permet de contrôler son destin et de devenir un maître \"Devi\"... \n\nTrêve de blabla, vous lisez le pitch de DevQuest un jeu développé pour le DevFest 2015 à Nantes.  \n\nL’objectif de ce talk est donc de revenir sur les pratiques mises en oeuvre pour ce jeu codé uniquement avec les technologies du web mais aussi sur la packaging à prévoir autour d’un tel jeux !  \n\nAu programme: HTML5 / Modularisation / firebase / Go / ES6 / Sensors / REX / Bonnes pratiques de jeux / ..."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Les nouveaux supers pouvoir du web",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": " Objects connectés, IoT, Robotique",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 36,
"venue_id": "tobedefined",
"speakers": "jean-francois garreau, ",
"description": "Et si je vous disais que votre navigateur est doté de pouvoirs dont vous n’avez pas conscience ?  Et si l’installation d’une application n’était plus nécessaire pour interagir de façon riche avec les objets qui nous entourent ?\n\nBref, vous l’aurez compris dans ce talk, je vais vous parler des nouvelles possibilités qui s’offrent à vous en tant que développeur web et qui vont vous permettre de créer des applications web universelles ! \n\nNous évoquerons donc Sensors, Bluetooth, Physical Web, Usb, AppManifest, ..."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Let's React",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 39,
"venue_id": "tobedefined",
"speakers": "Mathieu ANCELIN, ",
"description": "React est une librairie JavaScript développée par Facebook pour créer facilement des interfaces graphiques. La particularité de React vient de son modèle de programmation orienté composant et de sa facon de décrire les vues de ces components. Contrairement à d'autres librairies, ici pas de templates et de pseudo code, React permet d'utiliser la pleine expressivité de JavaScript et de bénéficier de toutes les features du langage, notamment tous les goodies apportés par ES2015.\n\nDurant cette session orientée live coding, nous verrons comment utiliser React pour créer des composants graphiques dans le cadre d'applications web et d'applications mobiles natives grâce à React Native."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Developers can save the world... Yes we can",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 40,
"venue_id": "tobedefined",
"speakers": "Olivier Philippot, ",
"description": "Le logiciel peut avoir un grand impact sur nos sociétés ... du bon côté mais malheureusement aussi du mauvais côté. Ceci est le cas pour l'impact sur l'environnement: l'énergie des centres de données qui augmentent, IOT avec problème de batterie, l'autonomie des smartphone, l'obsolescence du matériel ...\n\nMais nous pouvons éviter cela avec l'application de pratiques simples sur votre logiciel. Dans cette session, je vais vous expliquer ce que plusieurs entreprises et équipes ont fait de leur côté: mesure de l'énergie, les règles d'éco-conception, benchmark des bibliothèques ...\n\nConcretement , que faire ? La mesure est la première  action. En effet, combien d'énergie consomme une VM ? Combien d''énergie est pompée sur la batterie si on lance un jeu ? Très peu le savent. Pourtant des outils existent. Par exemple sur Android, une api est disponible pour récupérer l'énergie consommée. Intéressant pour récupérer l'énergie associée à des tests. Ensuite, une fois que l'on a des mesures, on peut agir même sans connaitre de bonnes pratiques (machine learning inside developers)\n\nEnsuite le choix d'une librairie ou d'un language peut influencer largement l'efficience du logiciel. Chose d'autant plus difficile que l'usage de librairie devient de plus en plus simple... Un ptit go get et c'est parti. La clé ? maitriser la performance de sa librairie, la mesurer, comprendre ses fonctionnalités, choisir le juste besoin et pas plus... Dur mais à quoi bon faire un code aux petits oignons si on intégre 90% de bloatware.\n\nJ'entends certains me dire \"premature optimization is the root of all evil\". Oui il faut optimiser intelligemment. Mais attention cependant notre ami Donald Knuth a dit cela en 1974... Il y a 30 ans... A l'époque des codeurs aux petits oignons sur des machines contraintes. Notre course (nécessaire) vers des frameworks et langages plus flexibles et plus rapides a changé un peu le paradigme. On est maintenant sur du code \"Uniformement lent\" (Uniformly Slow Code). La faute à qui ? A nous tous. Alors le diable n'est pas dans l'optimisation prématuré mais plutôt dans la non optimisation. \n\nOui, il est possible (et simple) d'être un super green développeur et de sauver le monde!"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Mais qu'est-ce que je fous ?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 41,
"venue_id": "tobedefined",
"speakers": "Jeff Abrahamson, ",
"description": "Il y a un peu plus d'un an, j'ai écrit puis lancer un programme.\nDepuis lors, il me regarde, il note tout ce que je fais au moins une fois par minute.\n\nMon objectif ? Mieux comprendre ma vie, l'améliorer grâce aux données que ce programme récupère.\n\nJe me retrouve ainsi avec un bien beau projet de DataScience !\n\nA travers cette session, je vais vous montrer les différentes techniques d'apprentissage automatique que j'ai utilisées pour créer plusieurs modèles de mon activité.\nNous aborderons ainsi les bases du Machine Learning à travers une étude de cas appliquée à un contexte réel.\nNous tirerons ensemble les conclusions immédiatement appliquables à mon activité et nous verrons ensemble comment vous pourriez réaliser cette expérience chez vous."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Applications \"cloud-native\" avec Spring Cloud",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 42,
"venue_id": "tobedefined",
"speakers": "Stéphane Nicoll, ",
"description": "Cette présentation commence par démonter le buzz \"Microservices\" et explique les avantages et les défis de ce type d'architecture. On parlera \"Distributed/versioned configuration\", \"Service registration and discovery\", \"client-side load-balancing\" ou encore \"circuit breakers\". On expliquera tous ces concepts avec une application exemple réalisée avec Spring Cloud et Netflix OSS."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "L'Ere de la Plateforme",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 43,
"venue_id": "tobedefined",
"speakers": "Aline Paponaud, ",
"description": "Responsables de produit, équipes marketing, entrepreneurs, développeurs... Pour nous tous de nos jours, \"créer une plateforme\" ou \"avoir son API\" est un enjeu crucial. Cette session a pour objectif d'expliquer au travers de 7 étapes indispensables tous les impacts de la transition d'un ensemble logiciel vers une plateforme à tous les niveaux : produit, marketing, technique, projet, humain.\nAujourd'hui, de grands noms du Web réalisent jusqu'à 90% de leur chiffre d'affaires grâce à leur Application Program Interface (API). C'est devenu un argument marketing. De leur côté, les développeurs sont depuis longtemps convaincus que le futur se trouve dans les plateformes.\nEn tant que développeurs, il est facile de nous convaincre qu'une API ouverte est standard est le meilleur moyen de propulser nos applications vers plus de flexibilité, d'ouverture et de scalabilité. Pourtant... Il est difficile de transformer ces principes en une transition complète vers une plateforme. Et c'est bien de la même chose dont il est question ! Mener la construction d'une plateforme quand on est développeur implique de voir plus loin que le seul aspect logiciel.\nDans cette session, je vous propose de parcourir la transition d'un ensemble logiciel Web / Services vers une plateforme et son API. En parlant d'abord des enjeux pour le produit, le business, et ensuite des aspects techniques et de conception, pour enfin en venir aux considérations essentielles sur le plan organisationnel et humain."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Rogues do it from behind",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 48,
"venue_id": "tobedefined",
"speakers": "Nicolas Poirier, Jean-Louis Boudart",
"description": "Au quotidien tout développeur est confronté au service aux process \"sécurité\". Le temps passé avec eux est directement proportionnel à la façon dont vous concevez et exposez votre application. Dans cette présentation nous ferons un focus sur le concept des end-points dans une application Web mais aussi comment les lister et les gérer.\n\nA partir d'exemples de code remplis de faille de \"sécurité\", nous présenterons une façon de refactoriser le code au mieux pour supprimer les failles. L'objectif est de transformer votre application en paladin pour tanker au mieux les attaques des rogues !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Kit de survie : 10 outils en ligne de commande",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 50,
"venue_id": "tobedefined",
"speakers": "Julien Balas, ",
"description": "Vous n’êtes pas sur un projet qui à le dernier outil de collecte et d'analyse de log à la mode du cloud ?\nOn vous demande de trouver ce qui cloche dans l'appli de prod ?\nPas de panique : avec une grosse poignée de commandes de bases linux vous pourrez trouver rapidement cette proverbiale aiguille dans les gigas de logs du serveur.\nNote : on parle ici de : cut, grep, sed, awk et companie"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Eclipse, the good, the bad and the ugly",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 52,
"venue_id": "tobedefined",
"speakers": "Gautier de Saint Martin Lacaze, ",
"description": "Eclipse est un IDE vieillissant. Il est mal aimé en faveur d'autres outils plus performants pour le domaine Java. De plus, il est considéré comme simplement inutilisable pour le développement Web et notamment pour la partie JavaScript. \n\nEt si on soulevait un peu le capot de cet IDE pour apprendre à mieux le connaître au travers des questions suivantes :\n\n* Quelles sont les faiblesses de l'environnement et comment y remédier ? \n* Comment découvrir les forces qu'il cache et en retirer le meilleur ?\n* Qu'apportent les versions Mars et prochainement Neon de l'IDE dans notre quotidien de développeur ? \n\nAvec cette présentation, on verra donc le moche, le mauvais, mais surtout le bon dans Eclipse, en apprenant à l'utiliser efficacement sans s'arracher les cheveux ."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Aurelia and the space cows",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 53,
"venue_id": "tobedefined",
"speakers": "Philippe Charrière, ",
"description": "A l'heure des objets connectés nous allons créer une webapp de gestion de vaches connectées dans l'espace à l'aide du  framework Aurelia. \n**Le simulateur de vaches de l'espaces sera fourni**. *(ainsi que toutes les API associées)*\nNous verrons à travers ce workshop si Aurelia sera capable de tenir la dragée haute à ses concurrents renommés, notamment Angular 2 ;)\n\nNotre objectif sera en 55 minutes d'apprendre à initialiser correctement une application Aurelia et d'en utiliser les composants principaux pour que vous soyez ensuite à même de construire vos propres applications en toute autonomie.\n\nDans les grandes lignes, nous verrons:\n\n- Installation/Initialisation\n- une peu d'ES6 (2015)\n- les composants\n- le routeur\n- les requêtes ajax + SSE\n- le déploiement\n- ..."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Bob.Next() ou une nouvelle tentative de Zeira Corp pour construire le Terminator",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": " Objects connectés, IoT, Robotique",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 54,
"venue_id": "tobedefined",
"speakers": "Philippe Charrière, ",
"description": "L'ancêtre de John Henri s'appelait BoB (plus communément appelé le T0). Ce premier POC permit à Zeira Corporation de qualifier ses choix techniques :[https://youtu.be/zd3j6yPLmdY](https://youtu.be/zd3j6yPLmdY).  Bob, répondant à toutes les espérances de l'entreprise, il fut décidé de passer à la vitesse supérieure et de mettre en oeuvre le projet Bob.Next(): La construction d'un mini robot de téléprésence destiné à envahir vos bureaux, maisons, salles de conférences, ...\n\nA la différence de son prédécesseur exclusivement conçu à partir de JavaScript, Bob.Next() sera polyglotte: Python, C, C++, JS, ...\n\nBob.Next() sera composé de différents modules (écran, caméra, son, déplacement, communications, sensors, et interface de pilotage)\n\nIl y aura du Raspberry, de l'Arduino et d'autres composantes \n\nLes ingénieurs de Zeira Corp ne seront pas tous présents le jour du talk, mais l'équipe du projet Bob.Next() est composée de:\n\n- Thierry Chantier\n- Philippe Charrière\n- Emmanuel Feller\n- Une personne que l'on ne peut pas citer par déontologie\n\nSkynet est déjà là"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Et si on codait l'IOT?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": " Objects connectés, IoT, Robotique",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 55,
"venue_id": "tobedefined",
"speakers": "Philippe Charrière, ",
"description": "L'IOT est le buzzword du moment (même si ça existe finalement depuis longtemps). Plutôt qu'uniquement en parler,  je vous propose un atelier où vous apprendrez à \"faire\" du MQTT,  ce qu'est CoAP, ... J'aurais un/des objet(s) connecté(s) avec différents capteurs. Vous devrez vous connectez et interagir avec eux à partir de ce que je vous montrerai. Il y aura beaucoup JavaScript, du Java et même un peu de Python. A la sortie de l'atelier, vous aurez les idées plus claires sur ce que peut être l'IOT et comment en devenir un acteur.\n\nObjectifs:\n- apprendre à utiliser MQTT (broker+client)\n- survoler CoAP\n- Utiliser MQTT, le SDK Groove et Johnny Five  pour interagir avec du matériel physique (Raspberry Pi, GrovePi, Arduino)\n- Et si vous êtes assez rapide vous apprendrez à piloter un drone \"en équipe\", avec MQTT et CylonJS (et si vous ne l'êtes pas, on pourra toujours continuer dehors, mes \"Raspberries\" fonctionnent sur batteries)"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Introduction à la programmation Reactive avec RxJS",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 56,
"venue_id": "tobedefined",
"speakers": "Grégory Houllier, ",
"description": "La programmation reactive est un pattern dont la popularité ne cesse de grandir. Angular2 et Cycle.js se basent sur RxJS pour la gestion des flux d'évènements. Durant ce tools in action nous verrons les concepts et les possibilités offertes par RxJS notamment dans la simplification des traitements asynchrones dans une application JavaScript."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Ionic, Native Script, React native... Quel framework mobile hybride choisir?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 57,
"venue_id": "tobedefined",
"speakers": "Stéphanie MOALLIC, ",
"description": "Vous avez envie de développer une application mobile, mais quel framework choisir parmi les plus populaires? Et si nous faisions un comparatif entre ces framework pour savoir comment orienter notre choix..."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "HTTP2, ce qui va changer !",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 58,
"venue_id": "tobedefined",
"speakers": "Julien Landuré, ",
"description": "HTTP1 est omniprésent en 2016 et HTTP2 est pourtant \"sorti\" le 15 mai 2015. Qu'est-ce qu'on y gagne, nous développeurs ? Les principes d'optimisation Web seront-ils toujours d'actualités ? Venez découvrir HTTP2, le futur protocole du Web !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Et si Elasticsearch devenait notre base de données de référence ?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 59,
"venue_id": "tobedefined",
"speakers": "Bruno Bonnin, ",
"description": "De nos jours, on constate de plus en plus la présence d'Elasticsearch comme complément aux bases de données, pour des besoins d'analyses par exemple. La puissance des fonctions de recherche d'Elasticsearch associée à des outils tels que Kibana et Logstash permet de construire un environnement puissant. Finalement, on peut se poser la question : pourquoi continuer de mettre nos données dans une base et dupliquer des infos dans Elasticsearch ? Pourquoi ne pas faire d'Elasticsearch notre seule source de données, notre référence ? Qu'est-ce qui nous pousserait à basculer d'un côté ou l'autre de la Force ?"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "La relecture de code : avant tout des pratiques !",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 60,
"venue_id": "tobedefined",
"speakers": "Eric SIBER, ",
"description": "Quelle est l'utilité de la relecture de code ? \nBonnes pratiques, mauvaises pratiques, comment s'y prendre pour mener cette tâche à bien malgré les obstacles organisationnels ? \n\nCette session vise à sensibiliser les participants à la problématique de relecture de code. Souvent ce sont les outils qui font le buzz, reléguant les pratiques et leur adoption au second plan. Loin des effets whaou de la démo d'un outil, je souhaite vous sensibiliser au pourquoi et comment, tout en illustrant par des pratiques : de la plus élémentaire à la plus tendance. Des pistes seront données à l'audience pour mettre en place ou renforcer la démarche qualité sur le terrain, ainsi que les références aux outils qui s'inscrirons dans ces pratiques..\n\nA l'image du premier principe du manifeste agile (Les individus et leurs interactions plus que les processus et les outils), la présentation sera donc largement tournée sur l'humain, le relationnel, elle ne détaille ni ne fait la promotion d'un processus ou d'un outil donné de relecture de code (qui seront néanmoins mentionnés)."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Votre défi : installer une culture d'apprentissage",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 61,
"venue_id": "tobedefined",
"speakers": "Eric SIBER, ",
"description": "La formation est en ébullition : entre l'explosion des conférences / BBL et l'essor de la formation en ligne, la formation classique est mise à mal par les nouvelles possibilités que ces canaux nous procurent. Les premiers pas du CPF (Compte personnel de formation) en remplacement du DIF (Droit individuel à la formation), plus restrictif dans le choix des formations à l'initiative de l'individu, ont pour l'instant tendance à accentuer l'écart entre les sources de montée en compétence traditionnelle et celles plus innovantes mais moins encadrées.\n\nToi, développeur, qui doit te mettre à niveau régulièrement par rapport à l'état de l'art et des nouvelles technologies et pratiques, comment peux tu soutenir ce rythme toujours plus intense ?\n\nToi, employeur, qui a le soucis de maintenir l'employabilité au sein de ta structure, comment peux tu innover et soutenir tes salariés dans cet apprentissage constant ?\n\nVoici quelques questions auxquelles je me propose de répondre :\n- Quelles sont ces nouvelles sources d'apprentissage amenant des bénéfices immédiats ?\n- Comment intégrer ces sources d'apprentissage dans votre quotidien et les faire adopter à vos organisations ?\n- Est-ce que c'est rentable ? Quels sont les bénéfices pour l'organisation ?\n\nCette présentation repose sur des expériences personnelles, des observations, mais également des success stories."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Lambda architecture en pratique avec Spark et Cassandra",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 72,
"venue_id": "tobedefined",
"speakers": "Thomas Le Naour, Thomas Mouron",
"description": "**Introduction à Spark et Cassandra au travers d'une lambda architecture :**\n\n**Spark** est le framework de traitement de données le plus populaire actuellement.\n**Cassandra** est une base NoSQL colonnes conçu pour stocker de très grosse volumétries.\n\n  Nous vous proposons de découvrir au cours de ce hands-on les API **streaming** et **batch** de Spark.  \n  Le sujet traité est **la collecte et le traitement de tickets de caisse dans la grande distribution**, via une lambda architecture.  \n  Le **speed layer**  s'appuie sur **Kafka**, le **batch layer** utilise **Cassandra** pour le stockage."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "PlantUML mettez la doc dans votre code",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 75,
"venue_id": "tobedefined",
"speakers": "Nicolas BOSSARD, ",
"description": "PlantUML, un outil permettant l'écriture facile de schéma sous forme textuelle que les développeurs peuvent include directement dans le code.\nGrace à cet outil les schémas écrits par les Products owner sont maintenus par les développeurs, \n\tles points critiques de specs sont à jour\n\tça profite à tout le monde : nouveaux venus, testeurs..."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Conteneurs : portabilité et déploiements multi-clouds",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 76,
"venue_id": "tobedefined",
"speakers": "Julien Corioland, ",
"description": "Les conteneurs et les technologies comme Docker permettent de changer la manière dont les équipes de développement et IT travaillent au quotidien, en simplifiant notamment l’adoption d'une démarche DevOps, la portabilité des applications entre différent Cloud et même le déploiement d’application en mode multi-Cloud. \nDans ce talk, vous découvrirez comment les différentes plateformes Cloud existantes peuvent être mises à profit pour héberger vos applications conteneurisées !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Docker en Production ? Et quid de la sécurité ?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 77,
"venue_id": "tobedefined",
"speakers": "Jean-Marc Meessen, ",
"description": "Envie de pousser votre application dockerisée jusqu'en Production ? Mais est-ce suffisamment mature pour protéger correctement les donnés et les systèmes qui nous sont confiés ?\n\nDocker est devenu une star technologique rendant accessible et utilisable la conteneurisation. En trois ans, cette techno a beaucoup murri et apporte désormais des réponses, souvent innovantes, aux challenges du monde de la Production. Beaucoup d'annonces passionnantes ont d'ailleurs été faites lors du Dockercon EU 2015 à Barcelone.\n\nCet exposé fera l'état des lieux de l'aspect \"sécurité\" pour y voir plus clair à travers le \"FUD\" (Fear, Uncertainty and Doubt) qui entoure cette techno (surtout dans les milieux du Management). Nous aborderons des sujets comme \"user name space\", \"secarmor/selinux\", Trusted Registry, project Nautilus sans pour autant nécessiter une connaissance approfondie de Docker."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "And the beats go on!",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 78,
"venue_id": "tobedefined",
"speakers": "David Pilato, ",
"description": "[And the beat goes on - The Whispers](https://www.youtube.com/watch?v=fOaxEa5ONJw)\n\nVenez découvrir le nouveau Data Shippers pour Elasticsearch:\n\n* Packetbeat : décortiquez les protocoles réseau\n* Topbeat: récoltez vos métriques\n* Filebeat: analysez vos logs en temps réel ou transmettez les vers logstash pour enrichissement\n\nEt comment contribuer au mix et ajouter vos propres beats avec Libbeat."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Ready, Set, Go!",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 79,
"venue_id": "tobedefined",
"speakers": "Pierre Zemb, ",
"description": "Vous avez peut-être entendu parler du [Go](https://golang.org), alias Golang, ce petit langage open-source porté par Google. Conçu pour un usage plutôt côté serveur, Il a obtenu ses lettres de noblesses dans le cadre des outils système/d’infrastructure comme Docker ou encore la création d’API.\n\nVenez découvrir un petit résumé de ce qui rend le Go différent et passionnant, et pourquoi vous devriez vous y intéresser, à travers ses forces, ses faiblesses et un petit live-coding."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Vizir : la TV qui veut devenir post-it à la place du post-it",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 80,
"venue_id": "tobedefined",
"speakers": "Morgan Gautier, ",
"description": "**Vizir** est le nouvel outil open source de management visuel !\nVous pouvez créer votre propre gestion visuelle en créant de nombreux widgets personnalisables , configurable et en temps réel ! Les widgets sont mobiles et redimensionnables pour être affiché sur tous les écrans que vous voulez! TV, smartphones , iPad , moniteur, vidéos projecteurs ...\n\n> A NE PAS IMPRIMER : Vizir est encore en phase de débug et doit arriver sur Github fin janvier."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Redécouvrez l'addition et la multiplication dans votre code",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 81,
"venue_id": "tobedefined",
"speakers": "Clément Delafargue, ",
"description": "En programmation, il y a des structures de données qui s'appellent les types\nde données algébriques (ou ADT).\n\nVous les connaissez, mais pas sous ce nom. Et ce que vous ne connaissez\nsûrement pas, c'est leur relation avec ce qu'on a tous appris en maths au\ncollège.\n\nOn va réviser ensemble l'addition et la multiplication; ensuite on verra en\nquoi c'est super utile dans vos programmes.\n\nSi vous êtes chauds, on frisera le niveau lycée avec les dérivées et les types\nde données correspondants."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Beyond flux: going full cycle with functional reactive programming.",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 82,
"venue_id": "tobedefined",
"speakers": "Clément Delafargue, ",
"description": "React and flux have shown us how to design UI in a modular fashion. One of the\ncore ideas, is that data should always flow in one direction. With this\nconcept, it's easier to build applications from independent modules. I'll show\nwhat react core concepts are and how they allow developers to manage\ncomplexity in big applications.\n\nI'll then show how to go one step further with Functional Reactive Programming\nand RxJS. After explaining what FRP is (and isn't), I'll show how FRP\nprinciples can unify a lot of different things in flux architectures. Cycle.js\nallows us to have a single direction rendering loop by representing both DOM\nand user interaction with observables, which come with an extensive API.\n\nFRP has been used for some time in UI frameworks (eg Reactive Cocoa for\nMacOS). Now its time has come in the javascript world, thanks to libraries\nlike RxJS and to the ideas pushed forward by React and Flux.\n\nAt the end of the talk, you'll have a basic understanding of how Flux works,\nyou'll know how RxJS works and how you can use FRP to design your client side\napplications."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Décrypter le SSL gratuit pour tous",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 83,
"venue_id": "tobedefined",
"speakers": "Damien Lecan, ",
"description": "Vous souhaitez migrer vos applications Web vers HTTP/2, dont l'usage dans les navigateurs impose une sécurisation par SSL/TLS. Mais vous pensez que c'est payant et compliqué.\n\nLet's Encrypt, qui revendique le SSL/TLS gratuit pour tous et de manière simple, serait-elle une solution à ce problème ?\n\nAprès un rappel du fonctionnement du Web sécurisé par SSL/TLS et de ses difficultés de mise en oeuvre, nous verrons ce qu'est Let's Encrypt et ses principes de fonctionnement. Ensuite nous utiliserons les outils proposés pour générer/renouveler des certificats et paramétrer le SSL/TLS dans un serveur Web, le tout gratuitement et simplement.\n\nVous verrez que sécuriser une application Web n'est finalement pas si compliqué."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Sécurisez vos applications Web gratuitement en quelques minutes avec Let's Encrypt",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 84,
"venue_id": "tobedefined",
"speakers": "Damien Lecan, ",
"description": "Vous souhaitez configurer SSL/TLS gratuitement et simplement sur votre serveur Web pour HTTP/2 ? Let's Encrypt est faite pour vous !\n\nAprès un rapide rappel du fonctionnement du Web sécurisé par SSL/TLS et de ce qu'est Let's Encrypt, nous utiliserons ses outils pour générer/renouveler des certificats et paramétrer le SSL/TLS dans un serveur Web Apache et NGinx, le tout gratuitement, simplement et en quelques minutes."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Full stack reactivity avec Meteor.js",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 85,
"venue_id": "tobedefined",
"speakers": "Anthonny Quérouil, ",
"description": "Vous souhaitez créer des applications réactives et virer vos spinners ? Vous cherchez un environnement de développement javascript efficace ?\n\n**Meteor.js** est fait pour vous !\n\nCe talk a pour but de vous présenter l'environnement **Meteor.js** et se passe en deux temps.\n\nUne première partie d'environ **15 minutes** pendant laquelle je ferai un tour d'horizon de Meteor.js, de son **fonctionnement** et de sa **philosophie**.\n\nUne seconde partie d'environ **30 minutes**, sous forme de **livecoding**, durant laquelle je mettrai en application ce qui a été présenté en première partie.\n\nJe suis quelqu'un qui marche au feedback et l'application **Tweetiments** qui sera développée se basera sur le stream public de Twitter, et fera une analyse de sentiment de ce qui se dira durant le talk. Le tout sera synthétisé dans un tableau de tweets.\n\nOn mixera le tout avec un peu d'**Angular** et de **React**"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "SBT, et pourquoi pas?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 87,
"venue_id": "tobedefined",
"speakers": "Fabrice Sznajderman, ",
"description": "Depuis quelques années Maven est devenu un standard. \nAujourd’hui, il est temps de dépoussiérer votre boite à outils et d’envisager de nouvelles perspectives. \n\nBien que SBT soit un outil de build  développé en Scala, il peut être utilisé bien entendu sur des projets java nativement. Il propose aux développeurs une approche interactive et efficace dans le travail au quotidien. \n\nDurant cette session, Nous parlerons de son utilisation au sein de *projets Java*. Nous aborderons les fonctionnalités qui permettront d’augmenter votre  productivité comme le continuous tasking,  l’exécution intelligente des tests et bien d’autres encore.\n\nVous êtes maintenant à la croisée des chemins, rester sur ses acquis ou découvrir le monde merveilleux du build interactif avec SBT :)"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Immutability: from code to infrastructure, the way to scalability",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 88,
"venue_id": "tobedefined",
"speakers": "Quentin ADAM, ",
"description": "The all functional programming world, Docker, Clever Cloud, micro service architecture, logs append only DB… All of this rely on the immutability at some point: infrastructure immutability, data immutability, append only. This is the way we now build some of the best scalable applications and infrastructure. The talk is made to understand why Immutability rules the scalability and why it’s important."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "How the Clever Cloud work? Radical decision to build great product.",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 89,
"venue_id": "tobedefined",
"speakers": "Quentin ADAM, ",
"description": "How the Clever Cloud work? build a PaaS using microservice since 5 years.\n\nClever Cloud is a well known Platform as a Service, build from scratch instead of relying on AWS or any other IaaS, using a lot of home made stuff instead of OpenStack, cloud foundry or any things like these. Why? Why do not use OpenStack? Why create VM instead of Containers? How do we manage security? Many of Architectures choices of Clever Cloud are very different from others product, Why? and is it working?\nAll the basics of Clever Cloud is made from microservices using ~100 projects to make it run. The talk expose the all architecture using many protocols (not only http) and how we build and manage change using this tech. How we can apply the \"use a tech, reach the limit, rewrite it\" pattern to manage growth and way to scalability.\n\nThis talk is mix of architecture presentation and return on experience.\n\nWhen I speak with people about how we work, many of them say \"you have to explain this on a conference, it's really radical and interesting\". So, there it is : how Clever Cloud work."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Streams on top of scala : why it's cool for everyone and what is the current state.",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Java, JVM, Javas SE/EE",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 90,
"venue_id": "tobedefined",
"speakers": "Quentin ADAM, ",
"description": "Tout le monde parle des streams sur la plateforme scala : Iteratee, scalaz.streams, Reactive streams, akka.io et aussi les inputstream java... Mais à quoi ça sert aux développeurs qui produise du code métier ? Est ce uniquement fait pour les créateur de drivers pour BDD ? Quel est la différence entre ces différentes piles ?\nLe but est d'être didactique sur les Streams, la politique de maintenances de ces APIs et comment s'en servir \"pour de vrai\".\n\nSuite à mon talk scala days sur les iteratee ( http://www.parleys.com/play/53a7d2d0e4b0543940d9e565/chapter61/about ) j'ai pas mal réfléchi à comment faire pour rendre la programmation par stream accessible au maximum et pouvoir expliquer la différence entre les implémentations, pourquoi elles existent... et surtout en quoi ça peut aider du code métier a être meilleurs."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "RabbitMQ 101 : job scheduling, micro service communication, event based data stream… How to cook the rabbit?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 91,
"venue_id": "tobedefined",
"speakers": "Quentin ADAM, ",
"description": "Lots of people need job scheduling, micro service communication, asynchronous information… There is a stable and reliable solution: AMQP protocol. Event if it seems to be complicated at the first look, it can solve lots of problem with a stable and battle tested product, great performances, simple access from C, java, python, ruby, node.js, scala, go… This talk is about rabbitMQ, how to start, how to like it, fundamental and various pattern to use it in real world case."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Web Dev Experience",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 92,
"venue_id": "tobedefined",
"speakers": "Matthieu Lux, ",
"description": "L'expérience de développement est une nouvelle idée qui fait son chemin. Une application sera mieux réussie si le développeur a de bons outils, ne perd pas de temps et surtout : prend du plaisir à développer.\n\nLe Web a été très actif sur le sujet, l’outillage Web est en constante ébullition ces dernières années et développer un site Web n’a plus rien à voir avec ce que c’était il y a quelques années.\n\nMais c’est encore le far west, il y a de nombreux outils, ils sont souvent encore difficiles à appréhender et à configurer.\n\nJe vous propose une découverte ou une mise à jour des concepts de scaffolding, de preprocessing, linting, live reload, hot module reload, web optimisation… Cela passera par les outils qui font le buzz (ou pas) : [Gulp](http://gulpjs.com/), [NPM](https://www.npmjs.com/), [Yeoman](http://yeoman.io/), [Babel](https://babeljs.io/), [ESLint], [BrowserSync](https://www.browsersync.io/), [Webpack](https://webpack.github.io/), [Browserify](http://browserify.org/)…\n\nEnfin, je présenterai rapidement la solution que je propose à travers le développement d’un générateur Yeoman [generator-gulp-angular](https://github.com/Swiip/generator-gulp-angular) et, plus récemment, un projet plus ambitieux [FountainJS](https://github.com/FountainJS)."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Flexbox, et le CSS redevient fun !",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 93,
"venue_id": "tobedefined",
"speakers": "Hubert SABLONNIÈRE, ",
"description": "Tu penses que CSS c’est trop compliqué et que centrer verticalement un bloc relève de l’exploit, cette session est faite pour toi.\n\nLes Flexbox sont une nouvelle spécification W3C qui apportent à CSS une nouvelle manière de placer ses blocs sans hack.\n\nAu menu de cette session, du live-coding pour mieux comprendre comment ça marche, comment les utiliser et dans quels cas il serait compliqué de faire autrement. Nous aborderons également la question du support et l’outil auto-prefixer."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Modules ? Il n'y a pas que webpack !",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 95,
"venue_id": "tobedefined",
"speakers": "Jordane Grenat, ",
"description": "Avec l'arrivée des modules ES6, beaucoup de développeurs se sont tournés vers webpack pour bundler leurs applications web. Bien que moins mises en avant, des alternatives comme JSPM ou Rollup existent et permettent des approches différentes afin de cibler au mieux vos besoins."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "100% Stateless avec JWT (JSON Web Token)",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 97,
"venue_id": "tobedefined",
"speakers": "Hubert SABLONNIÈRE, ",
"description": "Dans nos architectures REST modernes, les bons vieux cookies de session ne suffisent plus. Il est temps de s’intéresser aux JSON Web Token : une nouvelle approche plus simple, 100% stateless et facilement scalable.\n\nPlus de stockage de session côté serveur. Plus de réplication de session sur le cluster. La consommation de multiples couches d’APIs avec une seule connexion devient plus simple.\n\nDans cette présentation, nous aborderons le fonctionnement des JWT, nous verrons comment gérer une session client et bien d'autres usages tout en pesant les avantages et inconvénients."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Progressive Web Apps : Le futur du Web arrive",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 98,
"venue_id": "tobedefined",
"speakers": "Hubert SABLONNIÈRE, ",
"description": "Une Progressive Web App, c’est un site Web responsive dopé aux Service Workers qui commence sa vie dans un onglet via une simple URL et qui termine sur l'écran d'accueil comme une \"vraie app\".\n\nCe nouveau concept nous promet un Web avec des notifications push, de la synchro en arrière-plan et un mode hors-ligne. Le débat Natif vs. Web est clairement relancé et au cours de cette session, je vous propose de découvrir pourquoi.\n\nNous aborderons le fonctionnement de base d’un Service Worker, les 9 attributs des PWA et nous verrons différentes expérimentations développées par la communauté."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Codons une pompe à Bière connectée sur Arduino Yùn",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": " Objects connectés, IoT, Robotique",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 106,
"venue_id": "tobedefined",
"speakers": "Gwennaël Buchet, ",
"description": "Développons notre objet connecté à un serveur distant : une pompe à bière connectée ! :)\nEtape par étape, assemblons et codons cette pompe sur l' Arduino Yùn et affichons en temps réel sur un site web distant la quantité consommée.\nUn objet vraiment utile :)"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Rex : Transformez votre doc Word en doc Web sous Sphinx",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 107,
"venue_id": "tobedefined",
"speakers": "Maxime Péan, ",
"description": "**Je vous montrerai comment on peut transformer sa bonne vieille documentation `Word` en documentation `Web` sous `Sphinx` de façon presque automatique. **\n\n- Nous verrons en live chaque étape de la transformation d’un document et les astuces qui permettent de gagner du temps pour enfin profiter d’une documentation vivante et connectée à son écosystème de développement. \n- Nous parlerons aussi  de la vie de sa documentation après avoir quitté Word et les gains d’une telle transformation. \n\nEt oui, quitter le format papier électronique pour un markup langage ça change la vie !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Tout ce que vous voulez savoir sur Redux",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 108,
"venue_id": "tobedefined",
"speakers": "Matthieu Lux, ",
"description": "?Initialement un PoC de développeur sur l'architecture Flux, [Redux](http://redux.js.org/) est passé, au cours de l’année 2015, du statut \"encore une nouvelle implémentation Flux\" au statut d'implémentation la plus populaire. Elle parvient aujourd'hui à fédérer les développeurs autour de Flux y compris en dehors de l’écosystème React.\n\nRedux est un nouveau paradigme de programmation pour les interfaces Web. Il propose de centraliser l’intégralité du contexte de l’application en un seul endroit organisant toutes les transformations de façon séquentielles et reproductible.\n\nJe vous propose un tour complet de la technologie par la même approche que préconise son créateur à savoir en allant voir directement le code de la librairie. Pas de panique ! L’essentiel de la librairie peut être écrit en 10 lignes.\n\nComment 10 lignes peuvent apporter un nouveau paradigme ? C’est bien ça la beauté de cette librairie. J’essayerais de vous l’illustrer en y ajoutant concepts et démos."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Apache Spark : Data Streaming dans un cluster Mesos en Production - Retours d'expérience chez Solocal / PagesJaunes",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 109,
"venue_id": "tobedefined",
"speakers": "Yann Vanderstockt, ",
"description": "Disposant d'un cluster Hadoop et de nombreux batches en PIG montrant leurs limites depuis 3ans, nous avons décidé de migrer l'existant vers une architecture en streaming avec Apache Spark (en Scala) et ES. La solution est maintenant en Production.\nConcernant la gestion des ressources systèmes, plutôt que d'utiliser Yarn nous avons fait le choix de partir sur Apache Mesos avec Marathon et Chronos pour plus de souplesse.\nAprès une introduction du contexte, un retour d'expérience sera fait sur les choix technologiques, les problématiques rencontrées et les résultats en production."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Entreprise libérée : du mythe à la réalité ?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 110,
"venue_id": "tobedefined",
"speakers": "Hervé Jacob, ",
"description": "Le buzz actuel autour des entreprises libérées fascine tout autant qu'il fait peur. Certains voient en ce concept le Graal du bonheur et du plaisir au travail, alors que d'autres redoutent une utopie extrémiste inventée par des gourous soixante-huitards, qui mènerait droit à l'anarchie puis à la faillite !\n\nUne fois n'est pas coutume, je vous invite à vous éloigner de ces débats d'experts passionnés le temps d'un talk et à réfléchir ensemble, de manière pragmatique et dépassionnée, au moyen de rendre ce rêve à la fois réel et efficace.\n\nJe vous propose pour cela de voyager dans l'histoire vraie de Zenika, la société que je participe à développer, et qui, dès sa création il y a 10 ans, bien avant la mode de l'entreprise libérée, s'est construite sur les bases de ses piliers fondateurs que sont le plaisir au travail, l'excellence et l'innovation, la croissance et la rentabilité.\n\nCe retour d'expérience réel illustrera de manière concrète la démarche progressive mise en place, les grands succès et les petites victoires, mais aussi les problèmes rencontrés, les doutes survenus et quelques écueils à éviter. Il vous donnera les arguments montrant l'intérêt pour votre entreprise d'aller dans cette voie. Quel que soit votre rôle dans l'entreprise, vous repartirez avec quelques clés pour bâtir à votre échelle le chemin vers sa libération. La transmission de notre passion et votre motivation feront le reste !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "De la donnée à l'information intéractive",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 111,
"venue_id": "tobedefined",
"speakers": "Rossi Oddet, ",
"description": "La plupart du temps, les données ne sont pas intéressantes en elles-mêmes, ce sont les informations qui peuvent en être extraite qui le sont.\nParmi les différentes techniques de communication d'une information, la visualisation représente sans doute l'une des meilleures. Elle offre au public ciblé  l'opportunité d'explorer et de comprendre un large ensemble de données.\n\nA travers de nombreux exemples, cette session va vous donner les clés de réalisation d'une bonne visualisation.\n\nAu programme :\n* Bien distinguer la donnée de l'information\n* Notion de modèles & relations pouvant être extraits des données\n* Corrélation et Causalité\n* Donner le contexte d'une visualisation\n* Comprendre l'impact des formes géométriques\n* De l'importance des sources\n* Visualiser des modèles temporels\n* Visualiser des proportions\n* Visualiser des relations\n* Identifier des différences\n* Intéractivité\n* Bonnes pratiques & erreurs courantes\n* Les outils du marché, Focus sur D3"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Github as a database",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 112,
"venue_id": "tobedefined",
"speakers": "David Pilato, ",
"description": "Dans cette session, vous découvrirez comment nous avons décidé d'utiliser github comme base de données pour le site [brownbaglunch.fr](http://www.brownbaglunch.fr/) pour gérer les speakers et les villes et comment à l'aide d'un webhook et un peu de code NodeJS nous synchronisons cette \"base de données\" avec [elasticsearch dans le cloud](https://www.elastic.co/found) pour offrir une recherche performante."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Imaginer et résoudre des problèmes inutiles, voilà comment j'ai appris Docker.",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 113,
"venue_id": "tobedefined",
"speakers": "David Gageot, ",
"description": "Apprendre un nouvel outil est un challenge. Vous apprenez les bases avec des \"Hello world!\" ou à la dure, en production.\n\nLes \"Hello world!\" n'amènent pas très loin et apprendre en production se résume souvent à parer aux problèmes dans l'urgence.\n\nAvec le temps, j'ai développé une stratégie pour apprendre : **J'imagine des problèmes stupides qui m'obligent à trouver des solutions à des problèmes qui m'étaient jusque là inconnus**.\n\n + Calculer les nombres de Fibonacci avec des Dockers imbriqués dans des Docker ?\n + Tester le \"echo\" le plus cher du monde : Un cluster de 100 noeuds qui prend du code Ruby, qui produit du Scala, qui produit du Scheme, ... (96 autres langages),  qui produit le code Ruby initial ?\n + Imbriquer un conteneur Docker dans un Linux, dans une VM, dans un Windows, dans une VM, dans un conteneur, dans un Linux ?\n\nChaque question me pousse à découvrir de nouvelles choses et m'offre une démo pour expliquer Docker à mes pairs."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Du Go Spaghetti au Cloud en moins d'une heure",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 114,
"venue_id": "tobedefined",
"speakers": "David Gageot, ",
"description": "J'ai fais le tour des Jugs (du monde?) avec une présentation \"*Du Legacy au Cloud en moins d'une heure*\". Le but était de montrer comment remanier du code spaghetti Java et produire une application Web à la fin, en moins d'une heure. L'occasion de montrer des techniques de refactoring, des outils de test en continu, la puissance d'IntelliJ.\n\n**Mais bon, ça, c'était avant. Maintenant je fais du Go. Et en Go on fait ça comment ?**\n\nChallenge accepté. Prenons le même code en Go et voyons si la toolchain Go et Vim nous amènent aussi loin.\nLe but ? Aller du Go Spaghetti au Cloud en moins d'une heure !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Monter un cluster Docker Swarm multi-cloud, ça prend combien de minutes ?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 115,
"venue_id": "tobedefined",
"speakers": "David Gageot, ",
"description": "Installer Docker sur une machine, c'est plutôt simple. Démarrer une paire de conteneurs avec Docker Compose, c'est du gateau.\n\n**Mais démarrer une application composée de 100 noeuds, sur un cluster à cheval sur plusieurs Cloud Providers, ça se compte en jours, en heures ou en minutes ?**\n\nNous allons voir comment utiliser Docker, Machine, Compose et Swarm pour atteindre notre objectif en un rien de temps."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "(Micro)services, loadbalancing et gestion des erreurs: comment bien gérer vos dépendances HTTP",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 116,
"venue_id": "tobedefined",
"speakers": "Christophe Furmaniak, ",
"description": "Que vous ayez choisi de développer votre application en tant qu'*ensemble de petits services* (qui a dit *microservices*?) ou sur un modèle plus classique, vous avez certainement à gérer des dépendances à des services HTTP.\n\nA moins de faire le choix de ne pas vous soucier de la disponibilité de vos dépendances (dans ce cas vous n’avez rien à faire ici), vous aurez à faire face à des problématiques telles que loadbalancing et gestion des erreurs.\n\nEn s’appuyant sur l’exemple d’une application distribuée très simple, nous parcourrons ensemble les différentes implémentations de solutions et les contraintes et bénéfices associés"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Dériver la documentation des protocoles JSON directement depuis leur implémentation",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 117,
"venue_id": "tobedefined",
"speakers": "Julien Richard-Foy, ",
"description": "Vous avez développé un super Web service, mais écrire la documentation de votre API n’est pas votre tasse de thé. Inévitablement, au fil des évolutions, des incohérences s’introduisent entre votre *implémentation* et votre *documentation*.\n\nHeureusement, il est possible de vous épargner ce labeur en **dérivant la documentation à partir de l’implémentation**.\n\nDans cette conférence, je vous montrerai comment construire une bibliothèque permettant de décrire des protocoles JSON et d’en dériver à la fois des décodeurs (ie. des traitements qui valident la structure des documents JSON et les convertissent en objets métier) et de la documentation (p.ex. du JSON-Schema).\n\nNous verrons, entre autres, comment décrire les protocoles JSON de manière compositionnelle (afin de décrire un protocole complexe à partir de protocoles plus simples) et comment produire différents types de documentation (JSON-Schema, jolie page HTML, etc.). Nous observerons également les limites d’expressivité de cette approche (peut-on décrire *n’importe quel* protocole JSON ?). Enfin, nous mettrons cet exercice en perspective avec des objets théoriques connus en programmation fonctionnelle, tels que des structures monoïdales et des foncteurs."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Dis papa, c'est quoi une conférence qui déchire ?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 118,
"venue_id": "tobedefined",
"speakers": "Eric SIBER, ",
"description": "Participant à des conférence nationales et internationales depuis plus de 10 ans, et ayant participé à l'organisation de la conférence Agile France en 2013, j'ai pu relever quantité de critères qui rendent une conférence hors du commun. Avec l'arrivée de notre fils en 2013, les critères de participation aux conférences ont été complétés, ce dernier ayant lui même ses propres critères d'appréciation ;-)\n\nAvec la contribution de Clément, je vous proposerai donc une synthèse des critères qui permettent d'aboutir à une conférence qui déchire. Et au fait, le BreizhCamp, il déchire ?"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Certification Spring Core, à quoi vous attendre.",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Java, JVM, Javas SE/EE",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 119,
"venue_id": "tobedefined",
"speakers": "Alan Menant, Alexandre Baron",
"description": "Vous envisagez de passer la certification Spring ? Tester vos connaissances ? Ou encore simple curieux ? Je vous ai concocté une série de questions-réponses issues de la certification officielle."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Web-components l'AJAX de la décennie 2010",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 124,
"venue_id": "tobedefined",
"speakers": "Dewitte Pierre-Alban, ",
"description": "Au top du hip il y a quelques mois et de plus en plus supportée par les navigateurs, la spécification web-components est difficile a situer au milieu des librairies javascript. Découvrez pourquoi elle deviendra dans la décennie le standard pour exposer une API Javascript et en quoi elle est le complément de nombreux frameworks.\nAprès un brève présentation théorique, nous découvrirons comment intégrer notre propre API grâce aux web-component dans une application en Vanillia, Angular, React, Backbone et plus si affinité."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Tout ce que le getting started MongoDB ne vous dira pas",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 125,
"venue_id": "tobedefined",
"speakers": "Dewitte Pierre-Alban, Bruno Bonnin",
"description": "- Installation __OK__ \n- Insertion d'un élément en base __OK__ \n- Lecture et modification du dit élément depuis votre application __OK__\n- __...__ \n- __...__ \n- Premier projet en production __OK__ \n\n**Découvrez avec des exemples tout ce qui se cache dans les trois petits points**   \nChoix d'un ORM, librairies de test unitaires, outils pratiques, solutions pour migrer ou extraire les données, options pour vérifier votre schéma, estimation de la volumétrie, sélection du moteur de stockage, monitoring, supervision, backup, bonnes pratiques pour être hautement disponible et pour passer à l'échelle."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "La check list pour réussir son projet avec MongoDB",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 129,
"venue_id": "tobedefined",
"speakers": "Dewitte Pierre-Alban, Bruno Bonnin",
"description": "- Installation __OK__ \n- Insertion d'un élément en base __OK__ \n- Lecture et modification du dit élément depuis votre application __OK__\n- __...__ \n- __...__ \n- Premier projet en production __OK__\n**Découvrez tout ce qui se cache dans les trois petits points**   \nChoix d'un ORM, librairies de test unitaires, outils pratiques,  options pour vérifier votre schéma, sélection du moteur de stockage,  bonnes pratiques pour être hautement disponible et pour passer à l'échelle."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "PHP asynchrone : pourquoi attendre ?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 130,
"venue_id": "tobedefined",
"speakers": "Frédéric Bouchery, ",
"description": "L'asynchronisme n'est pas quelque chose qui vient naturellement à l'esprit quand on développe en PHP, pas plus que le parallélisme. Seulement, nos applications web deviennent de plus en plus exigeantes en matière de performances, et des technologies comme Node.js tendent à démontrer le gain qu'apporte ce paradigme. Pourtant l'asynchronisme existe depuis longtemps en PHP, mais il n'est pas exploité. Dans cette présentation, nous allons faire un point sur ce qu'il est possible de réaliser et comment changer notre vision du développement linéaire tel que nous le concevons tous les jours."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Utopie de la généricité.",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 131,
"venue_id": "tobedefined",
"speakers": "Frédéric Bouchery, ",
"description": "Pourquoi, avec le temps, nos développements se complexifient ? Pourquoi n'arrivons-nous pas à conserver un code simple ? Quand on essaie de voir à plus long terme, souvent cela nous prend du temps, ce n'est pas simple à utiliser, et d'ailleurs, ce n'est pas utilisé ! Bref, est-ce possible de concevoir du code générique, réutilisable et qui dure longtemps, quelque soit la technologie que vous utilisez ?"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Dis-moi comment tu t'appelles, et je te dirai qui tu es",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 132,
"venue_id": "tobedefined",
"speakers": "Frédéric Bouchery, ",
"description": "Beaucoup d'erreurs de conception viennent d'une erreur de nommage d'une arborescence, d'une méthode, d'une variable ou autre. Car, finalement, ce n'est pas facile de nommer les choses, sans parler des conventions d'écriture : CamelCase, snake_case, français, anglais, avec information de type, etc. Faisons un point sur ce sujet pas si anodin, qui peut avoir de grandes conséquences."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "PHP Horror Story",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 133,
"venue_id": "tobedefined",
"speakers": "Frédéric Bouchery, ",
"description": "PHP a 20 ans, et les choses ont bien évolué depuis tant d'années. Avez-vous déjà osé regarder les lignes de code que vous avez commises il y a 10 ou 15 ans ? Horrible n'est-ce pas ? Si vous vous risquez à venir à cette conférence, je vous en montrerai des horreurs ; d'ailleurs je ne vous monterai que ça. Certains vont peut-être même rire jaune en voyant que finalement, ils en écrivent encore aujourd'hui, car l'objectif de cette plongée dans l'épouvante, c'est de faire une rétrospective de 20 années de mauvaises pratiques qui ont conduit à l'élaboration des bonnes pratiques d'aujourd'hui."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Le pattern de conception IPB",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 134,
"venue_id": "tobedefined",
"speakers": "Frédéric Bouchery, ",
"description": "Tout le monde connaît le pattern de conception MVC, il existe aussi le pattern ADR, mais connaissez-vous le IBP ? Non ? C'est normal, je viens de l'inventer ! Mais alors, qu'est-ce que IBP ? C'est une redéfinition du pattern MVC qui va vous éclairer comme un phare dans la nuit, et vous aurez la primeur de le découvrir."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "On a tué mon agilité !",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 135,
"venue_id": "tobedefined",
"speakers": "Frédéric Bouchery, ",
"description": "Il y a 15 ans, j'étais un passionné des méthodes agiles, XP, Crystal Clear, RAD, ASD, DSDM, Scrum, etc. Toute cette mouvance était une réaction face aux lourdes méthodes de l'époque. Aujourd'hui, les débutants ne connaissent pas vraiment d'autres façons de faire, et quand je regarde dans le rétroviseur, je me dis qu'on a tué mon agilité. C'est devenu un mot banal, déformé, sur-vendu. L'esprit n'est plus là. Mais rien n'est perdu, surtout quand on connaît leur histoire. Venez prendre un petit coup de boost agile !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Comment cuisiner les spaghettis ?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 136,
"venue_id": "tobedefined",
"speakers": "Frédéric Bouchery, ",
"description": "Singleton, injection d'un conteneur de services, couplage fort, urgence, patch, auto-configuration, auto-découverte, etc. voici une partie des ingrédients qui permettent de cuisiner de bonnes spaghettis architecturales. Entre bonnes et mauvaises pratiques, faisons le point sur l'inversion de contrôle, les services et les fabriques pour éviter que votre application ne soit une catastrophe culinaire !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Xtreme Refactoring Deathmatch",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 137,
"venue_id": "tobedefined",
"speakers": "Antoine Michaud, Marie-Laure Thuret",
"description": "Le refactoring, c'est bien. Le refactoring, c'est beau. Mais le refactoring, est-ce vraiment pragmatique ?\n\nEt si on arrêtait les débats stériles ? Avec Xtreme Refactoring, la seule loi : c'est le code. Dans cet environnement hostile, toutes les techniques sont permises.\n\nRejoignez le temps de ce hands-on le projet \"Tennis Underground\" en pleine expansion où vous pourrez démontrer vos talents de codeur face aux autres en livrant le plus rapidement possible toutes les nouvelles fonctionnalités qui ne cessent de germer dans les têtes de nos Products Owners.\n\nTDDeur, DDDeur, Crapman : imposez votre style !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Kill mutants, save your code!",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 138,
"venue_id": "tobedefined",
"speakers": "Eric Briand, ",
"description": "Les mutants attaquent et ils en veulent à votre code ! Ils exploitent chaque faille de votre couverture de code et l’expose au grand jour ! Mais grâce à PIT, vous allez pouvoir y remedier très vite et contrecarrer cette invasion ! Vos tests unitaires seront challengés et évoluerons pour devenir plus pertinents. Les mutants n’auront qu’à bien se tenir !\n\nLors de cette session, nous parlerons des principes du mutation testing et montrerons son application directe avec PIT, framework de mutation testing Java. Nous utiliserons des tests unitaires plus ou moins pertinents pour etudier la manière dont les mutations mettent en évidence et ciblent les carences des tests."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "A bas big browser ! Soyons libre avec electron !",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 139,
"venue_id": "tobedefined",
"speakers": "Eric Briand, ",
"description": "Big browser est partout maintenant, pour la moindre petite application on utilise Big Browser ! Mais soyons libre maintenant avec electron ! Nos applications web n'ont plus besoin de Big Browser ! Rejoignez le mouvement initié par GitHub ! \n\nNous allons construire au cours de cette présentation une application desktop cross platform avec electron en n'utilisant que des technos webs. Nous reviendrons sur le succès grandissant d’electron et passerons en revue aussi tout ce qu’’offre electron en matière de packaging, mise à jour, et testing."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Sass, pratique tout de suite",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 140,
"venue_id": "tobedefined",
"speakers": "Alvin Berthelot, ",
"description": "[Sass](http://sass-lang.com/) est devenu en peu de temps le **pré-processeur CSS** le plus populaire parmi les webdesigners et les développeurs front-end.\n\nRien d’étonnant à cela lorsque l’on voit ses fonctionnalités et son écosystème qui permettent de faciliter grandement le développement et la maintenance de feuilles de styles CSS.\n\nVous ne l’utilisez pas encore ?! Ou vous n’utilisez que les notions élémentaires …\n\nPlus pour longtemps, car cet **atelier vous apprendra à utiliser Sass**, de manière progressive, pour tirer pleinement profit de ses possibilités."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Pimp your Sublime Text",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 141,
"venue_id": "tobedefined",
"speakers": "Alvin Berthelot, ",
"description": "[Sublime Text](http://www.sublimetext.com/) est devenu en quelques années un éditeur de texte incontournable pour les développeurs travaillant sur les technologies front-end.\n\nSon approche éditeur de texte léger (à contrario d'un IDE surdimensionné) lui offre bien des avantages en terme de rapidité d'utilisation et de facilité de prise en main.\n\nCependant certaines fonctionnalités facilitant votre productivité vont vite s'avérer manquantes si vous le laissez en l'état.\n\nGrâce à différents moyens : préférences, raccourcis clavier, *snippets*, *plugins* ; je vous expliquerai comment **l’utiliser de manière optimale** selon votre besoin."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Évaluer la qualité de vos WebAPIs et leurs compatibilités.",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 142,
"venue_id": "tobedefined",
"speakers": "Biger Kevin, ",
"description": "Vous serez plongés dans le quotidien d’un architecte WebAPI devant s’assurer de la qualité et de la consistance des APIs qu’il met à disposition.\nNous suivrons le cheminement qui associe, à terme, les WebAPI à un graphe NoSQL que l’on peut requêter.\n \nNous évoquerons donc les WebAPI, Swagger, NoSQL, Neo4j, Hal+JSON..."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Jenkins, Docker, 2 bons amis, plusieurs possibilités",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 143,
"venue_id": "tobedefined",
"speakers": "Christophe Furmaniak, ",
"description": "Dans la vraie vie, on part rarement de rien.\nVous avez déjà une infrastructure Jenkins en place et vous voulez commencer à utiliser Docker pour vous faciliter les installations?\nVous êtes déjà à l’aise avec Docker et vous devez mettre en place ou révolutionner une infrastructure Jenkins?\nVous n’utilisez ni Docker ni Jenkins et vous voulez commencer en douceur?\nTout est possible!\nVenez découvrir et/ou explorer les différents cas d’utilisation de Jenkins et Docker en fonction des divers plugins disponibles et de la maturité de votre utilisation de Docker et de votre infrastructure technique."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Vers un Web HTTPS avec Let's Encrypt",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 144,
"venue_id": "tobedefined",
"speakers": "Jérémy Pinsolle, ",
"description": "Alors que le Web est en pleine migration vers le HTTPS, qui n'a jamais rencontré des difficultés pour obtenir et installer un certificat ? Entre la génération des clés, la demande de signature de certificat (CSR), la complétion du challenge il est facile de s'y perdre.\n\nEn 30 minutes, nous allons voir comment il est possible grâce à Let's Encrypt - une initiative de quelques grands noms de l'IT (Mozilla, Akami et Cisco pour ne citer qu'eux) - de compléter ces étapes sans intervention humaine et sans moyen de paiement."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Une base de données polymorphes",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 145,
"venue_id": "tobedefined",
"speakers": "Frédéric Bouchery, ",
"description": "Dans une base de données relationnelle, il est très difficile de modéliser une structure de données qui n'est pas fixe. Pire, comment permettre de changer la structure pour les nouvelles données tout en gardant les anciennes dans le format précédent ? Et si votre base devait accueillir plusieurs structures différentes en son sein, quelle serait la solution ? Une base de données documentaire serait une bonne approche, mais celles-ci sont \"schemaless\", et nous avons besoin que nos données soient structurées, sinon comment garantir ne serait-ce que leur affichage ? La réponse : une base de données polymorphes"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Le réseau, cet inconnu au coeur de vos applications",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 146,
"venue_id": "tobedefined",
"speakers": "Raphaël Luta, ",
"description": "Le fonctionnement des réseaux est souvent mal connu des développeurs alors même que celui-ci a un impact primordial sur la fonctionnement et la performance de la plupart des applications. \n\nCette présentation vous donnera les principes à connaître sur les réseaux et les protocoles TCP/IP, les pièges à éviter et quelques exemples concrets de paramétrage pour améliorer la performance de vos applications web ou mobiles."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "HTTP, The Next Generation - Episode 2.0",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 147,
"venue_id": "tobedefined",
"speakers": "Raphaël Luta, ",
"description": "La multiplication des accès mobiles et des nouveaux usages du Web a conduit, depuis 5 ans, au développement de nouveaux protocoles tels que WebSocket, WebRTC, SPDY, etc... pour supplanter ou compléter le vénérable HTTP/1.1, culminant par la ratification du protocole HTTP/2 début 2015.\n\nAprès un rapide comparatif des différents protocoles et de leurs fonctionnalités spécifiques, la présentation se concentrera sur le protocole HTTP/2, ses stratégies de déploiement possibles et bien sûr ses performances tant du point de vue ressenti utilisateur que montée en charge des serveurs."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Feedback Loop pour le développeur",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 152,
"venue_id": "tobedefined",
"speakers": "Christophe Jollivet, mickael Debonnaire",
"description": "On nous parle Time To Market et boucle de feedback dans les projets agiles, mais qu’en est-il pour vous dans votre travail de tous les jours?\nCombien de temps mettez vous pour savoir que la ligne de code Java ou JavaScript que vous avez ajoutée fait bien ce que vous voulez? Que devez-vous faire pour vérifier que votre modification de CSS est la bonne ?\nAu cours de cette présentation, nous vous montrerons quelques outils et astuces pour vous permettre de réduire votre boucle de feedback. Nous aborderons les systèmes qui redémarrent automatiquement vos projets ou exécutent vos tests lors des changements de code. Enfin nous vous présenterons des outils permettant de synchroniser vos tests manuels entre plusieurs navigateurs."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "How to Exploit All Sensors of Your Mobile Phone as an IoT Device",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": " Objects connectés, IoT, Robotique",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 155,
"venue_id": "tobedefined",
"speakers": "Abdellatif Bouchama, ",
"description": "De nos jours, l’Internet des Objets (IoT) est devenue un buzz world, on en parle de plus en plus, mais pour plusieurs ça reste une boite noire. \n\nA travers un exemple, comment on exploite tous les capteurs de notre téléphone mobile comme un objet de l’IoT --> IoT aura moins de secret pour vous!"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Booster votre activité multi-projets grâce à DevOps",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 156,
"venue_id": "tobedefined",
"speakers": "Anthony ARNAUD, anas ameziane",
"description": "Aujourd’hui, l’explosion du nombre de technologies et l’hétérogénéité des environnements d’exécution impliquent des chaines de production différentes et ceux pour chaque projet. Ce constat est plus particulièrement visible dans  les sociétés de services. Ainsi les coûts d’automatisation et de maintenance se retrouvent de plus en plus élevés.  Alors, comment optimiser et standardiser nos chaines de production ? La démarche DevOps est-elle une des réponses à cette problématique ?\nDurant cette conférence, nous allons vous exposer notre retour d’expérience à travers nos réalisations rendues possibles par l’assemblage de divers outils (LXC/LXD, Ansible, Consul, Packer, Collectd, Influxdb, Grafana) et par le développement d’un orchestrateur nommé \"maestro\". Prochainement disponible en open source.\n\u0000"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Migration de scripts PIG vers Apache Spark Streaming et batch en Production",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 157,
"venue_id": "tobedefined",
"speakers": "Yann Vanderstockt, ",
"description": "Apache Spark est de plus en plus vu comme le potentiel remplacement pour Hadoop MapReduce.\nDans cette présentation, Yann vous montrera les principales différences entre les deux technologies, les principes importants de Spark et Spark Streaming. Enfin, on finira sur les pièges à éviter et les bonnes pratiques à suivre pour mener à bien un projet Spark (Scala) en Production.\nYann a travaillé avec son équipe sur cette migration pour une bonne partie de l'année 2015 et le projet Spark Streaming est maintenant en production."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Au secours, je flippe !",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 158,
"venue_id": "tobedefined",
"speakers": "Benjamin Chossat, ",
"description": "Le feature flipping, un concept en vogue mais piégeux à mettre en oeuvre. Quand l'utiliser, pourquoi le mettre en place et surtout comment faire ? Avant, pendant, après le développement : venez découvrir les stratégies qui marchent et tout le bénéfice à en tirer."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Mise en place de Apache Mesos en production pour des projets BigData, mais pas que - Retours d'expérience",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 159,
"venue_id": "tobedefined",
"speakers": "Yann Vanderstockt, ",
"description": "Afin de pouvoir mutualiser nos ressources machines au mieux sur nos projets BigData chez PagesJaunes, nous avons mis en place un cluster Mesos en production en Haute Dispo (HA).\nActuellement ce cluster Mesos est utilisé par plusieurs de nos projets utilisant de multiples technologies comme Apache Spark, ElasticSearch...etc.\nAprès une introduction sur Apache Mesos, Yann vous présentera les différents outils utilisés pour le scheduling et la montée en charge (élasticité) de nos services sur le cluster.\nUn focus sera également fait sur les pièges à éviter, les avantages de cette approche et ces limites.\nEn fonction du temps restant, Yann couvrira les solutions de monitoring en place sur ce cluster."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Mob programming, Promesses tenues ?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 160,
"venue_id": "tobedefined",
"speakers": "Maxime Sanglan-Charlier, ",
"description": "Le Mob Programming consiste à regrouper une équipe entière dans une pièce équipée d'un seul poste de travail pour tout le monde.\nCette pratique vous promet entre autres une productivité accrue alors qu'une seule personne à la fois ne peut toucher le clavier ! \nPromesses tenues ?"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Entrez dans l'émeute avec Riot.js",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 161,
"venue_id": "tobedefined",
"speakers": "Cédric Tran-Xuan, ",
"description": "Si tu aimes l'approche par composants, que tu aimes Polymer et les WebComponents, que tu n'as pas encore compris et appris par cœur les 70 syntaxes absconses de databinding d'Angular 2, que React t'émeut (mais pas tant que ça), vient explorer Riot.js, une micro-librairie UI JS, micro mais plutôt maousse costaud !\nSimplicité et modularité sont les mots d'ordre de cette lib qui a tout d'une grande !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "HTTP/2 et UX : qu'est-ce qui va changer pour le dev (web) ?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 162,
"venue_id": "tobedefined",
"speakers": "Cédric Tran-Xuan, ",
"description": "À peine validée, la spec HTTP/2 promet de changer la vie ? Est-ce vrai ? Est-ce que cela va améliorer la performance de nos sites et applis web ? Va-t-on devoir changer nos habitudes de dev web ?"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Devenez un King avec Kong",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 163,
"venue_id": "tobedefined",
"speakers": "Cédric Tran-Xuan, ",
"description": "[L'ère des APIs](http://www.3scale.net/2013/06/software-is-eating-the-world-apis-are-eating-software/) est arrivée ! Il y en a partout et notamment dans les architectures micro-services. Comment gérer une API que l'on expose au reste du monde ? Comment la sécuriser ? Comment la contrôler ? Autant de questions auxquelles [Kong](https://getkong.org/) peut répondre en quelques appels REST !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "WebSockets & Server-Sent Events : pourquoi faire ? Comment ?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 164,
"venue_id": "tobedefined",
"speakers": "Cédric Tran-Xuan, ",
"description": "Le web devient mobile et temps-réel ... contrairement aux requêtes classiques HTTP !  Pourquoi de plus en plus de personnes utilisent des WebSockets ?Eet pourquoi pas Server-sent Events ? Rappel des bases de ces technologies, avantages/inconvénients de chacune & liens utiles."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Let's React : le lab !",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 167,
"venue_id": "tobedefined",
"speakers": "Sébastien Prunier, Mathieu ANCELIN",
"description": "Vous avez entendu parlé de React tout au long de l'année 2015 mais vous n'avez pas encore pris le temps de vous y mettre ?\nCette université est faite pour vous qui voulez vous lancer dans React !\n\nVous apprendrez les bases de React de la meilleure des manières : en codant ! :-)\nVous découvrirez également les outils à mettre en place afin de bien démarrer votre projet, ainsi que les bons patterns pour organiser correctement vos applications :\n\n* NPM\n* Webpack\n* Babel\n* ReactTestUtils\n* ESLint\n* Redux"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Scraping : les 10 erreurs à éviter",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 168,
"venue_id": "tobedefined",
"speakers": "Fabien Vauchelles, ",
"description": "Construire un scraper n'est pas de tout repos ! Les sites changent, protègent leurs données et l'on peut perdre des mois à optimiser un scraper sans utiliser 1/10 des données…\n\nVenez découvrir comment gagner du temps en évitant les pièges du scraping !\n \nA travers un retour d'expériences, nous verrons comment éviter le blacklisting, comment stocker des millions de pages sans surcharger votre machine et comment s'organiser pour ne pas scraper la terre entière :)\n \nDésormais, la récupération de données n'aura plus de secret pour vous !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Why do you need to automate your infrastructure ?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 169,
"venue_id": "tobedefined",
"speakers": "Guillaume Blondeau, ",
"description": "Dans cette présentation je ferai un retour d'expérience sur la gestion d'infrastructure.    \n\nNous verrons comment nous sommes passés d'une application hébergée sur Amazon Web Services (AWS) et gérée \"à la main\" à une solution complétement automatisée, du provisionnement au déploiement.  \n\nCe sera l'occasion de parler des problématiques, des solutions et de présenter [Ansible](http://www.ansible.com/), l'outil d'automatisation que nous avons utilisé."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Automation & Integration",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 170,
"venue_id": "tobedefined",
"speakers": "Mikaël Donikian, ",
"description": "Comment une usine logicielle peut améliorer le quotidien des développeurs et leur éviter de s'occuper des tâches répétitives pour se concentrer sur leur métier !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Atelier Eventstorming",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 171,
"venue_id": "tobedefined",
"speakers": "Maxime Sanglan-Charlier, ",
"description": "Venez découvrir cet atelier collaboratif qui vise à modéliser votre métier tout en réunissant ceux qui savent ce qu'il faut réaliser et ceux qui savent comment le faire.\nLe résultat obtenu est un modèle métier clair et concret, construit très rapidement grâce à la contribution active des personnes présentes. Les points de friction qui conduisent souvent à de mauvaises implémentations sont exposés très tôt et de manière naturelle. On met en évidence les options de modélisation viables mais bien d'autres choses aussi !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Mise en oeuvre d'une architecture microservices multilangages avec Docker",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 172,
"venue_id": "tobedefined",
"speakers": "Jean-Philippe Gouigoux, ",
"description": "Un lab où on monte une application complète avec sept services, dont du MongoDB, du Core .NET, du Java 8/Spark, du Python/Flask, du Node.JS et de l'AngularJS... Normalement, il faudrait deux heures juste pour installer les outils de développement et la runtime. Mais pas avec Docker, qui va nous fournir tout ce qu'il faut pour nous concentrer juste sur l'architecture et le code! Au final, un lab qui fonctionne et deux heures de retours d'expérience et d'astuces en provenance directe de la production. Seul prérequis : Docker sur votre poste, et avoir exécuté une première fois l'application comme décrit sur https://github.com/EditionsENI/mortgage, de façon à tout avoir en cache et ne pas perdre de temps avec les téléchargements initiaux."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Quand l’intelligence collective se met au service de de l'agilité",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 173,
"venue_id": "tobedefined",
"speakers": "Simon JAILLAIS, Aurélien Morvant",
"description": "Vous êtes-vous déjà posé la question : comment diffuser (polliniser) largement une culture agile au sein de votre organisation ? On parle souvent de pollinisation de l’agilité pour l’adoption en douceur sur la durée de l’agilité de proche en proche. Certains proposent par exemple (1) une manière de polliniser en douceur l’agilité dans les organisations en utilisant les codes des Forums Ouverts. Créer une « Rupture Douce » pour permettre de faire évoluer la culture d’une organisation et cela de manière pérenne est un véritable enjeu. Il existe d’autres pratiques, formats permettant d’impulser de l’intelligence collective pour la mettre au service de l’agilité.\nDans cette session, au travers de retours d’expérience, nous vous partagerons  comment l’utilisation de nouvelles pratiques collaboratives permet à tous les niveaux d’une organisation de mieux travailler ensemble en s’appuyant entre autre sur l’intelligence collective et ainsi de diffuser une culture agile.\n(1) Open Agile AdoptionTM  de Daniel Mezick"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "La programmation fonctionnelle, c’est juste pour faire des preuves ?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 175,
"venue_id": "tobedefined",
"speakers": "Julien Richard-Foy, ",
"description": "Trop souvent, la programmation fonctionnelle évoque de mauvais souvenirs de cours académiques sur les méthodes formelles, et ce paradigme de programmation est enterré.\n\nJe propose d’expliquer en quoi la programmation fonctionnelle apporte des réponses appropriées aux problèmes d’ingénierie logicielle contemporains.\n\nAinsi, nous verrons :\n - comment elle permet de modéliser plus précisément le domaine métier d’une application ;\n - comment elle permet d’écrire des programmes à des niveaux d’abstraction plus élevés, donc proches de la pensée humaine ;\n - son efficacité pour découper des problèmes complexes en plus petits problèmes indépendants, donc plus simples et dont le code est réutilisable ;\n - ses qualités intrinsèques qui en font un outil particulièrement approprié pour les systèmes distribués."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Les requêtes HTTP de l'extrême",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 176,
"venue_id": "tobedefined",
"speakers": "Vincent Cassé, ",
"description": "Tous ceux qui font du web connaissent HTTP. Mais que ce passe t'il quand on le pousse dans ses retranchements ? Comment réagissent les serveurs sur des uploads de plusieurs giga ? Que font les serveurs durant des downloads de plusieurs jours ? Comment ça se passe coté navigateur (oui, IE est aussi un navigateur !) ? Retour d'expérience sur nos expériences sur HTTP"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Timeseries appliqué aux couches de bébé",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Keynote",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 177,
"venue_id": "tobedefined",
"speakers": "Vincent Cassé, ",
"description": "Il y a encore un nouveau type de base de données à la mode en ce moment : les timeseries. Je tenterais bien de vous expliquer comment ça marche, mais je dois d'abord aller changer la couche de bébé..."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Soyez productifs avec les Chrome Dev Tools",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 181,
"venue_id": "tobedefined",
"speakers": "Julien Landuré, jean-francois garreau",
"description": "On sait tous aujourd’hui quelles sont les préconisations pour faire des beaux sites (applications web) responsives, maintenables, disponibles dans les plus brefs délais.\nMais savez vous comment nos navigateurs peuvent nous aider à optimiser ces applications ? \nCette session sera fait sous forme de live coding et nous vous montrerons comment Chrome  peuvent vous aider à tester et optimiser vos sites web."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "A la découverte du service discovery",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 182,
"venue_id": "tobedefined",
"speakers": "Jean-Eudes Couignoux, ",
"description": "A l'heure des infrastructures immuables, de la scalabilité horizontale et des micro services, maintenir à jour un annuaire de service peut s'avérer fastidieux. Une simple migration de machine peut impliquer un changement de son adresse IP et donc la mise à jour manuel d'un serveur DNS.\n\nDe même, le rajout ou la suppression d'un serveur web pour gérer votre charge va nécessiter la mise à jour manuel de votre configuration.\n\nAu cours de cette conférence, je vous introduirai la problématique du service discovery, puis je vous présenterai consul, un outil de la société Hashicorp."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Envoyer des informations via le réseau Sigfox",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": " Objects connectés, IoT, Robotique",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 183,
"venue_id": "tobedefined",
"speakers": "Nicolas Lesconnec, ",
"description": "Live coding sur Arduino\n* Relever des données d'environnement basiques (température par ex)\n* Les transmettre via le réseau Sigfox\n* Les récupérer sur son serveur\n* Les visualiser\n\nJe peux aussi proposer une conférence d'une heure sur ce qu'est Sigfox, les usages, la techno etc .. En entrecoupant de démos (sans live coding par contre ;) ) pour éviter d'endormir l'audience"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Intégration Continue pour le développement Web",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 186,
"venue_id": "tobedefined",
"speakers": "Cedric Le Gallo, Aurélien Baudet",
"description": "Pouvez-vous évaluer la qualité logicielle de vos application AngularJS ? La conformité à l'état de l'art de votre code ? La non regression de vos développements ? Nous oui ! \n\nA travers ce Tools In Action, nous allons vous présenter notre chaîne d'intégration continue adaptée au développement Web. Notre approche :\n\t- intégrer vos outils habituels (gulp, jenkins, et sonarqube) à des modules utilitaires Open Source créés spécifiquement pour les projets Web.\n\t- garder une cohérence sur la chaîne complète de développement (poste de dev vs intégration continue).\n\nLa démonstration couvre l'analyse statique du code et la couverture de code par les tests unitaires et d'intégrations sur un projet AngularJS Open Source."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Rancher, le (petit) orchestrateur docker qui vous veut du bien",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 187,
"venue_id": "tobedefined",
"speakers": "Christophe Furmaniak, Youcef Yekhlef",
"description": "L’introduction de docker en production se fait souvent petit à petit, en mode *nouveau format de packaging* plutôt qu’avec un *orchestrateur* docker.\n\nLes orchestrateurs comme *Kubernetes* ou *Mesos* peuvent faire peur de part leur potentielle complexité à être mis en oeuvre et intégrés dans une infrastructure existante.\n\nNous découvrirons ensemble **Rancher**, un autre orchestrateur docker, plus facile à intégrer, mais tout aussi puissant.\nNous verrons comment l'installer sans révolutionner son infrastructure, comment  l'utiliser et bénéficier de son utilisation dans des cas d'usage avancés comme le “rolling upgrade” d'un service."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Scraping haut débit: Comment consommer plus de 100 Go par jour ?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 188,
"venue_id": "tobedefined",
"speakers": "Fabien Vauchelles, ",
"description": "Il était une fois un codeur qui aimait son jeu de données. Mais il pensait que celui-ci manquait de sens.\n\nIl demanda à son voisin: “Peux-tu me prêter tes données ?”. Et son voisin lui dit :  “Je n'ai pas le temps. Mais tout est sur mon site”.\n\nPourquoi ne pas développer un scraper pour les récupérer ?\n\nAlors il écrivit un script qu'il mit en prod.\n\nL'histoire ne faisait que commencer… Comment distinguer des millions d'URLs vues et non vues ? Comment stocker des millions de page ? Comment répartir la charge ?\n \nVenez découvrir comment il implémenta une architecture de scraping efficace !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Éviter les protections anti-scraping avec Scrapoxy",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 189,
"venue_id": "tobedefined",
"speakers": "Fabien Vauchelles, ",
"description": "Aujourd'hui, le business de la data explose !\n\nVous êtes développeur, datascientist ou growthhacker et vous cherchez à enrichir vos données en les croisant avec d'autres informations.\n\nMais la plupart du temps, il est impossible de récupérer ces informations. Car les sites protègent leurs données publiques et bloquent les scrapers.\n \nVenez découvrir Scrapoxy, un outil open source qui vous permet d'éviter le blacklisting !\n \nNous l'intégrerons en live à un scraper pour contourner une protection (le statut HTTP 503).\n \nPeu de slides, beaucoup de démo et aucune raison de se faire blacklister !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Manipuler le temps sous Go",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 190,
"venue_id": "tobedefined",
"speakers": "Sébastien Quioc, ",
"description": "L'homme a toujours voulu maitriser le temps, le remonter, le ralentir, l'inverser. Il est au cœur de nos civilisations mais aussi de nos logiciels et ceci, sans ne pas poser problèmes de temps en temps. Comment reproduire une anomalie liée au temps? Comment exécuter des tests sur une fonction `sleep` sans mettre 1 heure? Nous verrons avec _Axis_ comment contourner ces problématiques."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Containers, VMs, Processes… Isolations, performances, i/o… How all of theses technologies work and compare? Going deep in the system and learn.",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 191,
"venue_id": "tobedefined",
"speakers": "Quentin ADAM, ",
"description": "The world is now trendy about containers, everybody use virtualisation, and there is begining of a new microkernel movement around… But how all of theses working? What are the differences between container and virtual machine? Why and where use docker, runc, roket, kvm, xen, virtualbox, includeOS, rancherOS? This talk is a full session to understand how these things work, compare, and learn how it’s made. So, let’s look at the engine, and understand the deep basis of the system. And yes, it will be understandable if you are not an OPS and not an expert, it’s the goal."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "IT automation, when \"industry\" is a good news",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Keynote",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 192,
"venue_id": "tobedefined",
"speakers": "Quentin ADAM, ",
"description": "Industrial revolution of intellectual production : from computer to team agility, how to work more efficient ?\nIndustrialize your software pipeline, be more efficient\n\nThere is a lot of trending words about hosting and clouds theres years, but just a few focused on the essential : how to make the process and the production of hosting really neat and without problems. We have to focus about industrialization like we did about electricity a century ago : produce stable standard with a high quality of service and availability, and develop the ecosystem of consumer. So, how the PaaS, the cloud and good process will end the server management ?\n\nWhat changes affects developer profession? How to make the process and the production of hosting really neat and without problems? We have to focus about industrialization like we did about electricity a century ago: produce stable standard with a high quality of service and availability, and develop the ecosystem of consumer. Can we end server management and build hosting as a commodity?\n\nThe talk is focus to explain what is the evolution of developer job and meanings in a industrial IT world.\nThere is some bullet point about this talk and how it's focus on market logical evolution to hosting as a commodity."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Résoudre le puzzle Jigsaw avec Gradle",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Java, JVM, Javas SE/EE",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 193,
"venue_id": "tobedefined",
"speakers": "Cédric Champeau, ",
"description": "L'introduction du système de modules Jigsaw dans Java 9 va indubitablement être l'ajout le plus disruptif au langage depuis sa création. Jusqu'ici, tous les ajouts (génériques, invokedynamic, lambdas) se sont fait sans trop de douleur. Jigsaw, en revanche, va probablement casser votre application. Rassurez-vous, pas uniquement la vôtre. Toutes. Et ça ne sera pas beau à voir. Mais il y a de l'espoir...\n\nDans cette session, nous parlerons des challenges que Jigsaw relève, et comment avec Gradle, vous pouvez vous préparez dès aujourd'hui à une migration. Nous montrerons quels sont les avantages de déclarer une API dès aujourd'hui, en utilisant Java 8 (ou antérieur), et comment vous pourrez passer à Java 9 simplement. \n\nPerformances de compilation améliorées, encapsulation forte, gestion de dépendances fine, cache distribué, autant de fonctionnalités qui viendront gratuitement avec le modèle logiciel de Gradle 3. Venez découvrir comment Gradle va vous aider, tout de suite, à modéliser vos applications et bénéfier d'une partie des avantages de Jigsaw tout de suite, sur Java 8 !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Gradle et gestion de dépendances par variante",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Java, JVM, Javas SE/EE",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 194,
"venue_id": "tobedefined",
"speakers": "Cédric Champeau, ",
"description": "Gradle vient désormais avec un nouveau modèle logiciel pour les applications Java, qui permet de gérer de manière très fine les dépendances. Vous pensez que le *scope provided* de Maven est suffisant ? Et si on vous disait qu'il y a peu de chances pour que vos dépendances pour déployer sur Wildfly soient les mêmes que pour déployer sur Tomcat ? De même, il est très probable que votre application n'aie pas besoin des mêmes dépendances selon la version du JDK qu'elle vise. Comment gérer la combinatoire ?\n\nMieux encore, Gradle va vous permettre de définir vos *propres dimensions de variantes* : une version payante et une autre gratuite ? Une version debug et une autre release ? Aucun problème ! Nous montrerons comment créer de telles dimensions, comment spécifier les dépendances spécifiques à chacune, et en règle générale comment ce modèle logiciel permet de s'affranchir des limites des systèmes de build traditionnels tout en étant extrêmement performant."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Git, 10 ans d'âge, grand cru, en pratique en 30min",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 195,
"venue_id": "tobedefined",
"speakers": "Bny benny, ",
"description": "Git est devenu un outil incontournable du quotidien de tous les acteurs de l'IT.\nDe sa version 1 à sa version 2, des bonnes pratiques aux tops nouveautés, de l'indispensable au WTF, venez découvrir 10 secrets, patterns et trucs-astuces pour booster votre productivité et la qualité de vos produits.\nWarnings : Peut entrainer des phénomènes d'addictions. A consommer sans modération et sans limite d'age"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Demain notre entreprise sera digitale... Tremblez GAFA, NATU !",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 204,
"venue_id": "tobedefined",
"speakers": "Bny benny, Simon JAILLAIS",
"description": "On l'entend souvent puis on regarde ses produits, on regarde son organisation, on essaie de se projeter et là ... on respire... puis vient LA question :  Qu'est -ce que je peux changer en premier ?\n\nPour beaucoup d'entreprises non digital natives, cet objectif peut apparaître comme un vrai Big Bang et générer beaucoup de freins.\n\nCommencer par mettre en place des pratiques d'ingénierie logicielle, une culture d'amélioration continue du fonctionnement de mon équipe, un outillage adapté pour l'industrialisation de nos lignes de produit, ...  ?\n\nQuels sont les shifts (mentaux, organisationnels, techniques, ...) pour faire vos premiers pas?\n\nQuels sont les quick-wins que l'on peut tenter pour engager le changement ?\n\nVenez découvrir nos propositions de réponses à ces questions durant notre conférence!\n\nN'hésitez pas à mettre l'ambiance ;)"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Ecrire un shell pour Elasticsearch avec NodeJS",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 205,
"venue_id": "tobedefined",
"speakers": "Bruno Bonnin, ",
"description": "Le shell de MongoDB permet un accès rapide à la base en quelques lignes de JavaScript. Dans cette présentation, on verra comment développer un shell équivalent pour Elasticsearch (avec des fonctions de get/index/count/search, d'affichage de JSON, de génération de csv, ...) dans un environnement NodeJS en utilisant des éléments de base comme la partie REPL (Read-Eval-Print-Loop)."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Web, Cloud, Puppet !",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 206,
"venue_id": "tobedefined",
"speakers": "Arnaud Morin, ",
"description": "Vous êtes un doux reveur ? \n\nToujours la tête dans les nuages ?\n\nAnticlichés, vous avez toujours voulu jouer avec des poupées (surtout celles de votre soeur) ?\n\nLes lignes de commandes ne vous font pas peur ?\n\nVenez découvrir comment nous allons utiliser **puppet** dans une infrastructure **Cloud** en déployant une petite application web!"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Docker, c'est pas que pour les Ops !",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 207,
"venue_id": "tobedefined",
"speakers": "Maxime Gréau, ",
"description": "Marre de perdre du temps à monter un environnement de développement ? A arrêter/démarrer/configurer tes services pour passer d’un(e) environnement/application à un(e) autre ? La suite Docker est ce qu’il te faut ! C’est LA clé pour être efficace avec ton environnement de développement ! \n\nQuelque soit le projet et les technologies utilisées, chaque dévelopeur devrait être capable de travailler rapidement et efficacement sans perdre de temps à configurer son environnement de développement.\n\nAujourd'hui  Docker, avec Machine et Compose, a quelque peu révolutionné la façon de travailler pour le développeur. Il est par exemple facile de développer dans un environnement proche de celui de la production.\n\nA travers une application exemple, tu verras comment être performant pour développer, packager, déboguer, et exécuter des applications Java EE, Web, multi bases de données grâce à Docker & Co."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "J'ai scala-ifier mes tests, maintenant ça va mieux",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 208,
"venue_id": "tobedefined",
"speakers": "Fabrice Sznajderman, ",
"description": "Scala, un autre language de la JVM, propose plusieurs librairies permettant de simplifier et d'enrichir la façon d'écrire ses tests unitaires.\nQue l'on ait une approche BDD ou xUnit, vous retrouverez ici le style qui vous va bien et mieux encore...\n\nDurant ce talk, je vous présenterai ScalaTest et ScalaCheck. Ces deux librairies permettront d’écrire vos tests de manière élégante d’une part et d’autre part d’avoir une couverture exhaustive des cas d’utilisation en seulement quelques lignes de code.\nNous verrons également, comment les intégrer dans nos projets maven de tous les jours.\n\nSi vous êtes las des librairies de tests traditionnelles, venez découvrir de nouveaux horizons … :)"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Du natif avec Angular 2 et NativeScript !",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 209,
"venue_id": "tobedefined",
"speakers": "Antoine Cellier, ",
"description": "Le monde du mobile n’a jamais été autant en ébullition grâce à différents outils facilitant le développement d’application cross-plateformes et natives. Nativescript propose aux développeurs javascript de réutiliser leurs compétences pour développer des applications natives sous iOs et Android. Grâce à un travail réalisé en lien étroit avec l’équipe d’Angular 2, Nativescript s’annonce comme un outil incontournable pour développer des applications mobiles natives basées sur des technologies web.\n\nJe vous propose de découvrir les concepts de Nativescript ainsi que sa mise en oeuvre avec Angular 2."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Introduction au langage Go",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 211,
"venue_id": "tobedefined",
"speakers": "Pascal LE MERRER, ",
"description": "Découvrez le langage Go et sa philosophie, à travers des exemples de code. Ce langage mis en lumière par docker est particulièrement bien adapté à un déploiement dans le cloud."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Microservices : tout ce qui brille n'est pas d'or.",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 212,
"venue_id": "tobedefined",
"speakers": "Pascal LE MERRER, ",
"description": "Vos entendez parler des microservices sans arrêt, mais n'avez pas encore eu l'occasion vous y confronter. Nous allons revoir les caractéristiques de ce style d'architecture, ses avantages, mais aussi les problèmes qu'il induit. Nous passerons également en revue quelques patterns et outils employés pour mettre en oeuvre des microservices."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Cycle de vie des images Docker : problèmes et solutions",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 213,
"venue_id": "tobedefined",
"speakers": "Alexis Tual, ",
"description": "Docker se répand à vitesse grand V. En particulier les conteneurs Docker sont utilisés tout au long des pipelines de \"Continuous Delivery\", du développement jusqu'à la production. \n\nComment alors faire le tri dans la montagne d'images Docker produites, les promouvoir ou les rejeter ? Comment transposer les pratiques connues depuis longtemps avec les packages Java, .Net... aux images Docker ? \n\nNous allons montrer comment implémenter un modèle de promotion pour les images Docker et comment les distribuer selon les clients."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Retour d'expérience sur l'utilisation de Saltstack chez Cozy Cloud",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 214,
"venue_id": "tobedefined",
"speakers": "Nicolas Ledez, ",
"description": "Devops toussa tout le monde en parle. Les outils d'automatisations comme Puppet, Chef vous vendent du rêve. Mais concrètement qu'est ce que cela peut donner pour passer d'une centaine d'instances à plusieurs milliers.\n\nPlusieurs parties dans la session :\n- Comment c'est installé chez nous\n- Ce sur quoi nous avons bloqué\n- Comment nous avons résolu certains problèmes\n\nEt tout ça avec du code dedans :)"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "devoxx4kids",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": " Objects connectés, IoT, Robotique",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 215,
"venue_id": "tobedefined",
"speakers": "Nicolas Ledez, ",
"description": "C'est quoi ?\nProgrammer, coder, développer, concevoir du logiciel, pisser du code, ... autant de mots pour expliquer notre métier. Mais comment l'expliquer à nos enfants ?\nSurtout qu'ils vont vivre de plus en plus avec du code omniprésent. Le but de l'atelier n'est pas d'en faire le prochain Bill Gates ou Linus Torvald (quoique). Mais de les initier au monde de la robotique. Du coup ce qui est génial, c'est que l'on touche à la mécanique, l'électronique et au code. La plate-forme utilisée, va être des Lego Mindstorms EV3.\n\nCela va leur permettre de voir qu'un PC ne sert pas qu'à faire du Facebook et regarder les vidéos de Cyprien sur YouTube :)\n\nEt d'entrevoir que le robot aspirateur qui parait un peu con, et bien en fait c'est que c'est plus compliqué à programmer qu'il n'y parait.\n\nÇa se passe comment ?\n\nÇa s’est déjà passé comme ça :\n<a href=\"http://li.ro/6PKe\">Les photos de l'année dernière</a> et les vidéos :\n\nhttps://www.youtube.com/watch?v=ysMG2SF1qO4\n\nhttps://www.youtube.com/watch?v=rPCWyFF_bac\n\nImportant :\n\nAttention, il faut minimum avoir 10 ans et venir avec un adulte."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Swagger pour avoir une API Web trop stylée",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 216,
"venue_id": "tobedefined",
"speakers": "Herve DARRITCHON, ",
"description": "Les API Web ont envahi le monde depuis quelques temps, il n'est pas rare que telle ou telle application web expose des API pour s'interfacer avec le reste du Web. Certains outils ont basé toute leur stratégie sur l'intégration d'autres outils au travers d'API (exemple : Slack). Une synergie se créée autour des APIs d'un outil et avec elle de la valeur ajouté pour les utilisateurs.  C'est pour cela que bien documenter son API est important afin de facilité son utilisation et se faire connaitre.\nJe vais vous montrer comment utiliser l'éco-système Swagger pour documenter vos APIs."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Comment nos données peuvent nous rendre service en temps réel",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 219,
"venue_id": "tobedefined",
"speakers": "Maxime Péan, Damien Lecan",
"description": "On nous prend nos données mais nous aimerions bien qu'elles nous rendent service et en temps réel s'il vous plait !\n\nNous allons donc vous présenter les principes de base d'une plateforme temps réel de traitement de données.  Nous verrons comment le pattern de la boucle de rétroaction permet de construire un service qui s'adapte à nos besoins en temps réel. Nous parlerons d'architecture, d'outils et de plateformes cloud, le tout illustré par des démos et des exemples de code.\n\nTout ça pour qu'enfin nos données nous rendent service !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Quoi d'neuf Docker (live) : Histoire brève",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 220,
"venue_id": "tobedefined",
"speakers": "De Loof Nicolas, ",
"description": "Dans l'esprit de la chaîne Youtube \"Quoi d'neuf Docker\", une présentation de l'histoire du projet Docker ... en animation"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Progressive app : La quintessence des technologies Web",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 221,
"venue_id": "tobedefined",
"speakers": "Kevin Pennarun, ",
"description": "Derrière le terme **Progressive App**, se cache une nouvelle classe d’applications ayant toutes les caractéristiques des applications natives. \nPourtant, elles sont uniquement construites à partir de  technologies du Web.\n\n\nLe fonctionnement offline, les notifications push, les performances et l’installation sur la home screen, ne nécessitent plus forcément de développement natif et de publication sur les stores d’applications.\n\nNous allons voir comment les navigateurs récents permettent de résoudre ces problématiques afin de se rapprocher de l’expérience utilisateur des applications natives."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Sécurité Frontend",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 222,
"venue_id": "tobedefined",
"speakers": "Jérémy Pinsolle, Pauline GALVAO",
"description": "Aujourd’hui, les applications web sont de plus en plus complexes et manipulent des données toujours plus sensibles, la question de la sécurité n’est donc pas une option.\n \nSur la base de notre expérience de sites grands public, nous vous proposons de découvrir et d’exploiter les failles les plus communes, à travers des exemples concrets d’intrusions, tout en vous apportant les éléments de correction.\n\nSi vous souhaitez démystifier les termes XSS, CSRF, injection, sanitization ou encore CSP ce talk est fait pour vous !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Kubernetes University, Cap sur l’orchestration Docker !",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 223,
"venue_id": "tobedefined",
"speakers": "Jean-Baptiste Claramonte, Cédric Hauber, Gérôme Egron",
"description": "De nos jours, de plus en plus d’entreprises adoptent Docker. Mais comment faire avec des dizaines, des centaines voire des milliers de conteneurs à gérer ?\nGoogle s’est posé ces questions et de ses forges une réponse est sortie : le projet Kubernetes.\nVenez marcher dans les pas du géant en découvrant Kubernetes dans son intimité. Vous apprendrez à déployer une application, la scaler, la mettre à jour en rolling update et l'isoler des environnements. Entre démonstrations et retours de terrain, vous repartirez avec tous les outils pour conteneuriser la planète."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Dis-moi où tu es et je te dirai qui tu es !",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 224,
"venue_id": "tobedefined",
"speakers": "Romain Vernoux, ",
"description": "La localisation est devenue l’une des données personnelles les plus prisées et nombre d’applications web ou mobile sont aujourd'hui basées (presque) entièrement sur cette information. Pourtant, il n'existe pas d’architecture généraliste permettant sa collecte et son utilisation. J'en présenterai une : Android et son API Location, Google Cloud Messaging, Java et PostGIS.\n\nJe proposerai ensuite d'utiliser les données collectées par cette stack sur le téléphone de quelques amis pour essayer de deviner ensemble leurs adresses, leurs métiers, leur bar favori... et mon cadeau d'anniversaire."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Docker Birthday #3 Celebration + Training",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 238,
"venue_id": "tobedefined",
"speakers": "De Loof Nicolas, ",
"description": "Docker a 3 ans, et pour fêter l'événement Docker Inc. organise à travers le monde des _training_ pour initier les débutants. Profites du BreizhCamp pour découvrir cette techno les mains dans le cambouis."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Réaliser une bonne recette grâce au concombre",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 239,
"venue_id": "tobedefined",
"speakers": "Shoun Ichida, ",
"description": "Les méthodologies de développement type 'tests first' sont en plein essors : TDD, ATDD, BDD... Elles permettent de mettre en place des bonnes pratiques de développement tout en améliorant la qualités des livrables (code coverage, moins de bug, etc).\nÀ travers un live-coding, je vous propose de mettre en pratique un exemple de BDD (Behavior Driven Development) avec Cucumber Java.\nNous allons voir comment réaliser un backend en Java exposant une API REST définie dans des fichiers Gherkin, testée à l'aide de cucumber-jvm. \nCette démonstration nous permettra de constater qu'un backend peut être couvert par des tests fonctionnels et qu'une couverture de code importante peut être obtenue en adoptant de bonnes pratiques de développement et avec un effort modéré.\nPour aller plus loin j'introduirais comment travailler avec le Métier pour que les tests fonctionnels soient consistants avec leur besoins et peut les amener au TDR (Test-Driven Requirements) dans la gestion et suivi de projet."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Découverte de Docker",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 240,
"venue_id": "tobedefined",
"speakers": "Pascal LE MERRER, ",
"description": "Vous n'avez pas encore fait le saut, et n'utilisez pas encore Docker au quotidien. Nous allons reprendre les bases, voir comment Docker fonctionne et s'utilise, mais aussi prendre un peu de recul pour voir dans quel écosystème Docker s'inscrit."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Développer une application mobile avec Ionic",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 241,
"venue_id": "tobedefined",
"speakers": "Stéphanie MOALLIC, ",
"description": "Vous avez toujours voulu développer une application mobile mais vous n'avez pas eu encore le temps de vous plonger dans les specs Android ou iOs. Vous connaissez AngularJS, HTML,  CSS et Javascript? Grâce à Ionic, vous allez pouvoir développer votre première application mobile et vous pourrez cocher cet item dans votre liste de chose à faire!\n\nPré-requis:\n- Node et npm installés\n- Android Studio ou/et XCode installés et configurés"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Déploiement ELK en conditions réelles",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 242,
"venue_id": "tobedefined",
"speakers": "Geoffroy ARNOUD, ",
"description": "Le trio Elasticsearch-Logstash-Kibana est très populaire dans le monde de la supervision applicative. Cependant, pour déployer un unique cluster à l'échelle d'une entreprise, même en mettant de côté la volumétrie des données, il reste certains écueils à éviter :\n  * Comment gérer la multitudes de serveurs, tous différents ?\n  * Comment gérer les applications, également toutes différentes ?\n  * Comment adresser la sécurité ?\n  * Comment présenter des données pertinentes à des publics différents (exploitants, MOE, MOA...) ?\nEt tout cela sans alourdir la configuration du système ?\n\nLe but de cette présentation est de montrer la mise en place de la stack ELK, la configuration de base ; puis toute la logique permettant d'adresser la complexité d'un système d'information complet.\n\n*Outils utilisés : ELK, Redis, rsyslog, nxlog, sans oublier Excel !*"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Enquête dans /proc. Ou comment faire parler un container, sans en avoir l'air",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 243,
"venue_id": "tobedefined",
"speakers": "Jean-Tiare Le Bigot, ",
"description": "Mr Container, tout le monde le connait. Ses parents s'appellent Namespace et Cgroup. On pense qu'il a des ascendants seccomp et autre. Mais sous ses couverts de personnage bien comme il faut, il recèle quelques secret, comme tout le monde. Comment le surveiller ? Ah, les métriques du cgroup, facile. Mais que se passe t-il si l'on va creuser dans le /proc ? Inutile ? Moins qu'une perquisition durant l'état d'urgence. Commençons."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "OpenScad : fabriquer des objets du monde réel avec du code source",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": " Objects connectés, IoT, Robotique",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 244,
"venue_id": "tobedefined",
"speakers": "Guillaume Collic, ",
"description": "Les imprimantes 3D et les fraiseuses numériques (CNC) se démocratisent pour transformer un modèle 3D numérique en un objet physique. Mais ce modèle 3D, comment le faire ? Nous ferons un rapide tour d'horizon des options possibles, puis nous détaillerons l'une d'entre elles : OpenScad, qui permet d'exprimer sous forme de code source des formes géométriques et de les combiner pour en faire des objets complexes. Ce code est ensuite facile à modifier, à paramétrer, et à partager pour collaborer collectivement dessus. OpenScad est ainsi devenu le standard principal pour partager des pièces techniques Open Hardware (l'Open Source du monde physique) pour imprimante 3D."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Write the (good) docs",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 245,
"venue_id": "tobedefined",
"speakers": "Florian Strzelecki, ",
"description": "Au quotidien, nous interagissons avec bon nombre de documentations, que ce soit pour monter un meuble ou comprendre le dernier framework à la mode. Ces documentations, il faut bien les écrire, à un moment ou à un autre. Que ce soit les commentaires dans le code ou le manuel utilisateur, \"écrire la doc\" est plus facile à dire qu'à faire.\n\nParlons en justement ! Il y a les outils, certes, et certains même assez largement répandus, mais ils ne répondent pas à la question qui se pose souvent : comment écrire une **bonne** documentation ? Connaître son public, choisir son style, établir une routine, suivre des bonnes pratiques... il y a beaucoup à dire sur le sujet ! Cette conférence sera l'occasion de faire un tour d'horizon de ce qui se fait, et de ce que l'on peut faire au quotidien pour écrire une bonne doc - qui sera, nous l'espérons tous, lue !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Ecosystème Python pour le web : quelle architecture, quel framework pour quelle problématique ?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 246,
"venue_id": "tobedefined",
"speakers": "Yann Gravrand, ",
"description": "Ce talk examine plusieurs solutions pour construire des sites et applications web à l'aide du langage python, en fonction des problématiques à résoudre.\n\nAprès un tour d'horizon et une catégorisation macro des différentes librairies et frameworks populaires, nous examinerons les principales fonctions offertes par ceux-ci.\nUne fois le framework choisi, plusieurs solutions sont envisageables pour traiter les requêtes entrantes. Nous aborderons les différentes mises en oeuvre de la concurrence en fonction du type de performances attendues (I/O, CPU...) avec un accent sur la gestion évènementielle popularisée dans le monde Javascript par node.js.\n\nLe talk se conclura par une revue d'exemples d'architectures utilisables pour des besoins typiques du web d'aujourd'hui : Single Page Application, Real time, IoT, microservices..."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "De la webapp à l'application native",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 247,
"venue_id": "tobedefined",
"speakers": "Matthieu Bréchet, ",
"description": "Lorsque l'on développe une application web. La déclinaison en application de bureau peut être intéressante.\n\nCependant l'univers des applications natives pose souvent des problématiques non maitrisées par les développeurs web.\n\nL'idée de ce tool in action est de présenter les différentes contraintes du monde natifs et de voir comment convertir simplement une application web en version native.\n\nPour cela je vous présenterai un exemple concret en utilisant le framework [Electron](http://electron.atom.io/), développé par [github](https://github.com/) et utilisé par [Atom](https://atom.io/) comme installeur.\n\n<img src=\"https://camo.githubusercontent.com/5dd01312b30468423cb45b582b83773f5a9019bb/687474703a2f2f656c656374726f6e2e61746f6d2e696f2f696d616765732f656c656374726f6e2d6c6f676f2e737667\" width=\"350\" alt=\"Electron\"/>"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "L'atout du Golang : Concurrence, Parallélisme et goroutine.",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 248,
"venue_id": "tobedefined",
"speakers": "Marc Audefroy, ",
"description": "Le golang, nous en entendons de plus en plus parler. Surtout de son fameux \"go mafonction()\" qui permet de faire de l'asynchronisme pour un coup minime par rapport aux threads classiques. Mais comment ça marche?\nQuelle est cette formule magique qui permet de créer plus de 100 000 goroutines sans aucun problème? \n\nAu travers de ces questions, nous parlerons des notions de concurrence, de parallélisme ou encore de communication entre les goroutines."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Go pour les développeurs Java (mais pas que)",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 249,
"venue_id": "tobedefined",
"speakers": "Marc Audefroy, ",
"description": "Go, vous en avez sans doute entendu parler. Mais avez-vous consacrer un peu de temps de votre veille technologique dessus?\nSi la réponse est non alors cette conférence vous interessera. Langage, Concurrence, Composition, Réflection, Tools, Vendoring, nous ferons un tour d'horizon de tout ce qui compose ce langage en faisant des parrallèles au langage Java. L'objectif de cette conférence sera de vous montrer la philisophie qui se retrouve dans le langage et un peu plus encore."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Independence day",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 250,
"venue_id": "tobedefined",
"speakers": "Frédéric Bouchery, ",
"description": "Aujourd'hui, mener un projet sans outils de gestion de dépendances serait une mauvaise idée. Dans l'écosystème PHP, Composer est devenu un incontournable, et SemVer semble avoir apporté de l'harmonie dans l'anarchie des numéros de version. Mais il y a un revers à tout cela, et je vous propose d'analyser avec vous les conséquences de cette évolution afin d'endiguer une dérive qui risque de nous coûter cher à l'avenir."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Structurer les structures sans structure",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 251,
"venue_id": "tobedefined",
"speakers": "Frédéric Bouchery, ",
"description": "Il y a de cela pas très longtemps, concevoir une application utilisant une base de données relationnelle impliquait de passer du temps à structurer, modéliser, hiérarchiser les données car il est très difficile de modifier cette structure à posteriori. Pour gagner en souplesse, certains se sont orientés vers des bases NoSQL sans structure. Seulement, on a besoin de garantir la structure des données si on veut pouvoir la manipuler sans difficulté. Aujourd'hui, une troisième voie se dessine, à mi-chemin entre ces 2 solutions."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Le hasard fait bien les tests",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 252,
"venue_id": "tobedefined",
"speakers": "David Pilato, ",
"description": "Souvent, \"le hasard fait bien les choses\".\n\nSi on applique cette idée aux tests unitaires ou aux tests d'intégration, on peut rendre nos tests beaucoup plus imprévisibles et du coup trouver des problèmes que notre esprit n'aurait jamais osé imaginer !\n\nVenez découvrir comment l'équipe elasticsearch a mis en place une stratégie de tests aléatoires en Java à l'aide de [RandomizedTesting](https://labs.carrotsearch.com/randomizedtesting.html) et comment la (mal)chance peut vous aider.\n\nPar exemple:\n\n    int input = generateInteger(\n                Integer.MIN_VALUE, \n                Integer.MAX_VALUE);\n    int output = Math.abs(input);\n\nPeut générer `-2147483648`... Ce qui est assez inattendu pour une valeur absolue ! :)\n\nLes tests aléatoires peuvent découvrir ces cas tordus...\n\nIls nécessitent évidemment de tester sans arrêt le code et doivent s'accompagner d'outils d'intégration continue, tel que Jenkins.\n\nAprès cette conférence, vous ne verrez plus jamais la fonction `random()` comme avant !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Jenkins 2.0 - On jette tout et on recommence?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 253,
"venue_id": "tobedefined",
"speakers": "Arnaud Héritier, ",
"description": "[Né Hudson en 2004](http://kohsuke.org/2011/01/11/bye-bye-hudson-hello-jenkins/) le projet Jenkins est aujourd'hui omniprésent dans toutes les DSI.\nAvec plus de 600 releases, Jenkins a essayé (avec plus ou moins de succès) de conserver la compatibilité au fur et à mesure du temps que cela soit pour ses données (vos projets) ou son ecosystème (ses plugins).\nAujourd'hui l'équipe a enfin pris la décision de lancer les développements de [Jenkins 2.0](https://groups.google.com/d/msg/jenkinsci-dev/vbXK7JJekFw/BlEvO0UxBgAJ) qui devrait voir le jour d'ici la fin du premier semestre de cette année.\nCela pose beaucoup de questions:\n\n  * Pourquoi après plus de 10 ans, franchir enfin le pas dans la création d'une nouvelle version majeure?  \n  * Quels sont les changements et les nouveautés que les utilisateurs vont en tirer? \n  * Quels vont être les impacts en terme de compatibilité pour les utilisateurs et son ecosystème?  \n\nSi les réponses à ces questions vous intéressent cette conférence est faite pour vous!"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Jenkins, et si vous vous mettiez à jour?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 254,
"venue_id": "tobedefined",
"speakers": "Arnaud Héritier, ",
"description": "Cela fait maintenant des années que vous étes habitués à utiliser Jenkins. \nVous en arrivez même à un point que vous oubliez (certains de) ses défauts. \nPourtant Jenkins ne cesse d'évoluer et son ecosystème de s'enrichir. \n\n  * Utilisez-vous le plugin [Pipeline](https://wiki.jenkins-ci.org/display/JENKINS/Pipeline+Plugin) (ex-Worflow) pour orchestrer vos traitements?  \n  * Connaissez-vous le `Jenkinsfile` qui permet de versionner la configuration de votre projet Jenkins dans votre gestionnaire de sources? \n  * Savez-vous automatiquement provisionner vos projets Jenkins pour chaque branche en cours de développement de tous les projets de votre organisation GitHub ou BitBucket? \n   * Utilisez-vous docker pour lancez vos tests, isoler vos builds? \n\nSi vous ne savez pas répondre à ces questions venez découvrir toutes ces nouveautés dans cette session 100% demos qui vous permettra dès la semaine suivante d'améliorer vos pratiques de build et livraison en continue!"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "XSS is beautiful ou comment j'ai hacké le CFP du BreizhCamp",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 255,
"venue_id": "tobedefined",
"speakers": "Michel DAVID, ",
"description": "Qu'est qu'une XSS ? \nUne faille toute pourrie pour les Noobs, ça sert à rien, c'est que du Fishing.\nJe vais vous prouver le contraire avec un cas concret sur le site même du CFP du BreizhCamp! Une XSS est une porte d'entrée gigantesque à un grand nombre d'attaque web. A l'heure de la \"cyberdéfense\", après les traditionnelles SQL injections,  il est indispensable de prendre en compte ce type d'attaque et de prendre en compte ce risque dans \nnos développements. La sécurité ne doit plus être le parent pauvre du développement."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Guide de survie en milieu caractèriel",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 256,
"venue_id": "tobedefined",
"speakers": "Sébastien Quioc, ",
"description": "Tu penses qu'ASCII est une marque de lessive!! Que UTF-8 est le 8ème numéro d'un comics!! Tu ne comprends pas pourquoi PHP s'obstine à te dire qu'il a déjà envoyé les entêtes (alors que ta première instruction est d'ajouter une entête)!!\n\nSi tu réponds oui (et même non) à une de ces affirmations, le guide de survie est fait pour toi. Tu apprendras à y combattre le démoniaque \t&Atilde;&copy; et comment rechercher \"a\" et \"A\" simultanément."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Un service configurable avec Angular JS",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 257,
"venue_id": "tobedefined",
"speakers": "Benjamin Chossat, ",
"description": "Un service Angular, Facile ! Mais pour le réutiliser dans différents projets, voir le publier, il est bon de le rendre paramétrable. En 15 minutes et pas à pas, découvrez comment transformer un service basique en sa version industrielle !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Une plateforme de continuous delivery en 45 minutes",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 258,
"venue_id": "tobedefined",
"speakers": "Sylvain Révéreault, Mathieu Pousse",
"description": "Ce sujet est une sorte de \"live coding\" à la sauce DevOps, pendant lequel nous allons monter une plateforme à base de Git / Jenkins / Rundeck / Docker / Ansible / ... permettant d'illustrer le concept de Continuous Delivery. \n\nNous en profiterons pour parler des raccourcis que nous prenons lors de l'exercice, et des points durs lors de la mise en place d'une \"vraie\" plateforme CD."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Continuous Delivery en contexte Breton",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 259,
"venue_id": "tobedefined",
"speakers": "Mathieu Pousse, Maxime Odye, Julie Bourhis",
"description": "Julie, artisante émérite, travail beaucoup pour developper une nouvelle recette de sa patisserie bretonne favorite. Un soir, elle perce enfin les mystères du beurre et parvient à obtenir une version prête à partir en production pour le lendemain matin. Elle va voir Mathieu, jeune homme barbu et bourru, responsable opérationnel de la production pour finaliser les derniers détails.\n\nFeaturing Jenkins himself and other guests !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "La gestion des secrets dans l'infra as code",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 260,
"venue_id": "tobedefined",
"speakers": "Sylvain Révéreault, ",
"description": "Dans ce tools in action, nous regarderons quelques solutions techniques permettant de gérer vos secrets (clés, mots de passe, certificats, ...) dans une plateforme de type \"infra as code\"."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "UX 4 DEV",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 261,
"venue_id": "tobedefined",
"speakers": "Guillaume Gaulard, ",
"description": "En tant que développeur, comment designer une bonne expérience utilisateur ? Dans cette session, un développeur donne d’abord les clés qui permettent de produire une bonne UX. Cette approche est un condensé de différentes études qui facilitent l’analyse et la compréhension des besoins des utilisateurs. Il faut ensuite défendre vos idées et le mieux est d’avoir des références sur lesquelles s’appuyer. Pour cela, nous verrons comment utiliser une des grandes références en UX que sont les règles réalisées par les chercheurs en ergonomie Bastien et Scapin."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Kill all the REST with the Falcor",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 262,
"venue_id": "tobedefined",
"speakers": "Hugo Wood, ",
"description": "Tout comme Facebook, Netflix a présenté sa propre technologie qui pourrait sonner le glas des API REST, Falcor. Elle déclare avoir réduit la taille de son code serveur de 90% grâce à un unique end-point qui sert toutes les données. Deux entreprises de cette envergure qui implémentent ainsi des concepts très proches, cela mérite que l'on s'y intéresse. Après vous avoir expliqué le pourquoi et le comment, je vous propose que l'on explore ce que l'on peut construire avec Falcor. Et si on développait une API pour développer des API ?\n\n(Leonardo Dicaprio ne fera pas d'apparition lors de cette conférence.)"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "SparkR : l’outil qui réconcilie les statisticiens avec le Big Data",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 263,
"venue_id": "tobedefined",
"speakers": "Alban Phélip, ",
"description": "Ces dernières années beaucoup d’outils et de frameworks d’analyse de données ont vu le jour dans le monde du Big Data. Mais jusqu’à présent ils étaient principalement destinés aux développeurs. Que ce soit MapReduce ou Spark, leur utilisation nécessitait de connaitre des langages comme Java ou Scala qui ne sont pas les favoris des statisticiens.\n\nEt puis SparkR est arrivé. Cet outil permet d’utiliser la puissance de calcul de Spark en utilisant le langage R, numéro 1 dans le domaine des statistiques.\n\nVenez découvrir  dans cette session comment ces deux mondes cohabitent. Vous verrez la facilité avec laquelle un statisticien peut porter son code R vers du code SparkR et quels avantages vous pourrez en retirer !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "L’automatisation à tous les niveaux, la clé du succès en startup",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 264,
"venue_id": "tobedefined",
"speakers": "Julien Vey, Antoine Rouaze",
"description": "En passant d’une dizaine de serveurs il y a 3 ans, à plus de 1000 aujourd’hui avec des dizaines de montées de version quotidiennes, **Mirakl** a dû gérer les besoins d’une  start-up en pleine croissance. Avec une équipe de 5 personnes, l’**automatisation** est une nécessité. Antoine et Julien présenteront les problématiques qu’ils ont rencontrées à Mirakl et les solutions qu’ils y ont apportées. De la migration vers les plateformes Cloud, **AWS et Google**, à l'utilisation d’outils d’automatisation tels que **Ansible** et **Terraform**, la centralisation des logs, le monitoring, la gestion des sauvegardes etc."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Et si vos commerciaux utilisaient Docker ?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 265,
"venue_id": "tobedefined",
"speakers": "Julien Vey, Antoine Rouaze",
"description": "Chez Mirakl, nous avons depuis quelques mois mis en place une infrastructure Docker permettant de démarrer à la demande un nouvel environnement Mirakl. Cette plateforme était une demande forte de l'équipe Support, afin de reproduire un bug client; Des développeurs, afin de déployer et tester les dernières versions. Mais surtout des commerciaux, qui ont besoin d'avoir à disposition de multiples environnements pour des démos client, pour se former sur de nouvelles fonctionnalités avant leur sortie, etc.\n\nTout ceci est rendu possible grâce à l'écosystème Docker. Nous présenterons dans un premier temps l'infrastructure technique de la plateforme, basée sur Docker, Swarm, Compose, Consul, HaProxy.\n\nPuis nous parlerons de ce que nous avons mis en place afin que nos commerciaux soient autonomes pour utiliser cette plateforme; Les procédures et les outils qui leur permettent aujourd’hui de lancer des conteneurs Docker, par exemple en demandant à un bot sur Hipchat. Comment nous les avons accompagné pour leur faire appréhender sans crainte cette nouvelle plateforme. Et Enfin les bénéfices que nous en avons tiré, à la fois côté commercial, et coté opérations."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Tat - TextAndTags, the Swiss knife of communication",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 266,
"venue_id": "tobedefined",
"speakers": "Yvonnick Esnault, ",
"description": "Tat, a mix of IRC, Jabber, Slack,  is a communication tool - Human & Robot all together. SelfHosted, MicroService, Hackable and Pluggable. If you know describe a world with text, tags and labels, see the world with different user interfaces, this tool is for you.  Originally developed to support communication around the continuous delivery of pipelines, you can use it for any subject ... hum.. or topic. Talk in french."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Continuous Delivery on Golang Applications",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 267,
"venue_id": "tobedefined",
"speakers": "Yvonnick Esnault, ",
"description": "La prod est à vous, attachez votre ceinture ! Impossible de déployer des centaines d'applications par jour sans outillage. Venez découvrir l'écosystème Golang, sans parlez d'outils d'intégration continue, mais de tout ce que votre IC / CD va pouvoir utiliser pour faire passer votre code en production. 70% démo, 30% slides."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "L'experience Node.js par des développeurs Java",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 268,
"venue_id": "tobedefined",
"speakers": "Anthony COMMUNIER, ",
"description": "Node.js et Java sont 2 mondes qui se regardent souvent de loin avec méfiance. Java rentre dans sa phase de sagesse et se fait bousculer par Node.js qui trouve toute sa place dans un monde qui bouge de plus en plus vite. Le succès de projets réalisés en Node.js dans les mains de développeurs sevrés aux stacktraces Java est passé, dans notre cas, par une bonne industrialisation des phases de développements.\n\nCe talk se focalise sur une 1ère partie consacré à l'intégration de développements Node.js dans un éco-système Java via les outils éprouvés tels que Maven, Jenkins et Sonarqube.\nLa 2ème partie sera consacrée à l'eco-système Node.js et la vision que peuvent en avoir des développeurs Java suite à leur premier pas dans ce nouveau monde."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "0 feature et déjà 500ko de JS, vraiment ??",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 269,
"venue_id": "tobedefined",
"speakers": "Martin Mouterde, ",
"description": "J'ai démarré un projet JS \"à la vanille\", recodé plusieurs roues et... J'ai fini craqué en ajoutant jquery, lodash et momentJS. Résultat : la taille de l'appli a été multipliée par 5 ! \n\nDans ce tools in action, je vous propose de faire le point sur les solutions pour éviter de choisir entre une appli ultra légère mais qu'avec les API natives et une appli plus lourde mais qui profite des libs tierces."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Et si on arrêtait de se prendre la tête avec la documentation",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 270,
"venue_id": "tobedefined",
"speakers": "Guillaume SCHEIBEL, ",
"description": "“Est-ce que la doc est à jour ?”, “Elle est où la doc de la v1.5?”, “C’est quoi la différence avec la version précédente ?”, “C’est fatiguant de recréer à la main le PDF à chaque nouvelle version de l’application !”,“ C’est quoi le style pour les titres?”, “Arf Word m’a encore pété mes listes numérotés !”\n\nEcrire de la documentation, c’est la plupart du temps dans un fichier complètement distinct de l’application dont le format est contraignant pour le développeur, ce qui entraîne sa frustration et le résultat s’en ressent sur le livrable final. S’occuper de la forme n’est pas notre activité de prédilection, nous c’est le fond. Tout cela pour que ce document soit déposé dans un répertoire partagé voir au mieux dans une GED. Ne parlons même pas du fait d’essayer de voir la différence entre deux versions!\n\nSi cette introduction vous est familière alors Asciidoctor est là pour vous. Simple, clair et concis. Durant cette présentation nous allons voir ensemble la syntaxe, l’intégration dans une applications et dans son cycle de vie ainsi que la personnalisation du rendu. Et vous vous rendrez compte que faire de la documentation n'est pas forcément une prise de tête."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Akka: découvrons les bases",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 271,
"venue_id": "tobedefined",
"speakers": "Guillaume SCHEIBEL, ",
"description": "On parle beaucoup de \"reactive programming\" ou du \"reactive manifesto\" …? ça a l’air tellement cool et puissant hein! Mais ça veut dire quoi au juste ?\n\nDans cette session de live coding, on va ouvrir une boîte à outils nommée Akka. Mais pas de panique, si le Scala vous fait peur, il y aura aussi du Java ! On démarrera tranquillement avec un bon vieux \"Hello World\" pour finir sur des approches plus avancées telles que l’utilisation d’acteurs dit \"distants\". Et soyons fou, tant qu’on y est, parlons tests et monitoring.\n\nEn sortant, vous aurez compris les principes d’Akka et du Reactive Programming, le tout agrémenté d’un retour d’expérience, ce qui devrait vous donner des idées plein la tête !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "L'ISS en temps réel sur mon mobile en 15 mn ? Pari tenu !",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": " Objects connectés, IoT, Robotique",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 272,
"venue_id": "tobedefined",
"speakers": "Audrey Neveu, ",
"description": "Dans ce talk nous verrons comment en quinze minutes et en utilisant deux outils d'une simplicité redoutable, nous allons pouvoir réaliser une application mobile affichant la position de l'ISS sur une carte, en temps réel. \nD'un côté, Streamdata.io et son SDK qui en moins de dix lignes de code est capable de streamer n'importe quelle API et nous donnera la position de l'ISS comme si nous étions à bord. De l'autre, Ionic, un framework mobile hybride aussi efficace que puissant pour l'afficher et le déployer sur toutes les plateformes en moins de temps qu'il n'en faut pour le dire. \nAlors, on parie ?"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Introduction à Apache Zeppelin : visualisez vos données en quelques clics !",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 273,
"venue_id": "tobedefined",
"speakers": "Saad Ansari, ",
"description": "Analyser, manipuler et visualiser de gros volumes de données font partie des besoins récurrent des entreprises. Apache Zeppelin est un notebook web proposant une interface permettant d'analyser et mettre en forme simplement vos données.\n\nAu cours de cette présentation je vous propose de découvrir quelques unes des fonctionnalités de Zeppelin et comment cet outil peut, en quelques clics, vous aider à analyser vos données."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "3 nuances de MoM",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 282,
"venue_id": "tobedefined",
"speakers": "Guillaume Arnaud, ",
"description": "RabbitMQ, Kafka et NSQ. 3 Middlewares of Message pour distribuer des événements d'un producteur vers un consommateur.  3 modèles très différents de distribution, de consommation et de persistance. Dans quel cas je dois utiliser une de ces solutions plutôt que les autres ?\n\nA travers l'étude de ces 3 MoM (il en existe plein d'autres), nous essaierons de  définir les bons critères pour choisir le bon serveur de messages pour nos applications. La résilience, la garantie de réception ou le mode de distribution seront autant d'axes d'analyse."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Raft, dans quel état j'erre ?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 283,
"venue_id": "tobedefined",
"speakers": "Guillaume Arnaud, ",
"description": "Où sont localisés mes noeuds ?  Qui est le master ? A quelle version sont mes données ?Quel composant a le droit d'écrire ? \n\nDans un système distribué (une base de donnée, un cache, un server de message etc...), il est crucial de garantir que cette information soit disponible de partout, résilient aux pannes et surtout cohérent pour l'ensemble de tous les composants.\n\nDes algorithmes comme celui de Raft, répondent à ce besoin et on les utilise quotidiennement dans nos bases NoSQL, nos caches distribués ou nos outils de messaging. Je vous propose un petit tour dans les mécanismes passionnant de Raft."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Ansible , Infrastructure as code",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 284,
"venue_id": "tobedefined",
"speakers": "Walid Chergui, ",
"description": "Ansible est l’outil le plus en vogue actuellement dans le mouvement DevOps , grâce a plusieurs atouts et sa simplicité , sa légèreté , et la puissance des ses modules\n\nDurant cette conférence on va présenter Ansible et ses concepts , et les principaux modules , ensuite une demo live pour déployer une application web java , avec Tomcat ,Postgresql et un loadbalander HAPROXY"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Guide de survie du développeur perdu dans une application qui rame",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 285,
"venue_id": "tobedefined",
"speakers": "Brice LEPORINI, ",
"description": "Je suis développeur Java. L'application fonctionne parfaitement ou presque sur mon laptop. Je suis le seul utilisateur et ma base est quasiment vide... La campagne de tests de charge et ou la mise en prod révèlent un bilan alarmant: le projet ne tient pas ses objectifs en terme de performance et de scalabilité. La consommation mémoire et les temps de traitements dévissent complètement.\n\nC'est l'horreur. Je ne sais pas par où prendre le problème. Est-ce le moment de mettre à jour mon CV?\n\nRéveillez-vous de ce cauchemar! Je vous propose dans cette session de passer en revue les signes vitaux que la JVM met à notre disposition, comment les interpréter et de quelle façon il peuvent nous guider pour résoudre les problèmes de lenteur ou de scalabilité."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Spark ML : place à la pratique !",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 286,
"venue_id": "tobedefined",
"speakers": "Walid Chergui, Saad Ansari",
"description": "Spark ML est la nouvelle API de machine learning embarquée dans Apache Spark. Elle introduit la notion de pipelines en s’appuyant sur les dataframes et entend rendre plus accessibles la mise en place d’algorithmes d’apprentissage automatique pour les développeurs.\n\nL’objectif de cette présentation est de construire et tester ces notions introduites par Spark ML dans le cas d’un exemple concret : le calcul la cote d’un véhicule sur le marché."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Vert.x dans le \"hardware\"",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": " Objects connectés, IoT, Robotique",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 287,
"venue_id": "tobedefined",
"speakers": "Laurent HUET, ",
"description": "Dans un projet avec des composants \"hardwares\" variés (capteurs et actionneurs divers), vous êtes confronter à gérer de multiples événements en environnement restreint (Raspberry Pi, Beaglebone, ...).\nRien de plus logique donc que d’utiliser un framework \"reactif\" léger comme Vert.x pour ce type de projet quand vous venez du monde Java.\n\nVoici les ingrédients \"hardware\" du talk :\n* quelques capteurs et d'actionneurs (température, relais, ...)\n* des bus de communication bas niveau\n* des entrées/sorties numériques\n\nCoté Vert.x, les ingrédients utilisés seront :\n* boucle événementielle distribuée\n* API asynchrones (Web, Filesystem, Handler, ...)\n* modules Vert.x (Vertx-Unit, client MongoDB, ...)\n\nVenez découvrir dans ce talk, un exemple d'application Vert.x avec différentes problématiques événementielles et des exemples de réponses !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Dagger 2 - Back to basics",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Java, JVM, Javas SE/EE",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 288,
"venue_id": "tobedefined",
"speakers": "Jeremie Martinez, ",
"description": "Dagger 2 est sorti voila un an et permet enfin de réaliser l'injection de dépendances de vos applications complètement à la compilation. Cette présentation reviendra sur les bases et les concepts de l'injection de dépendances, présentera en détails l'API par des exemples concrets et démystifiera le fonctionnement interne de Dagger 2."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "DevOps sur Android : D'un git push à une release sur le Play Store",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 289,
"venue_id": "tobedefined",
"speakers": "Jeremie Martinez, ",
"description": "Tout le monde parle du DevOps, et maintenant même les développeurs Android. Dans cette présentation, nous allons voir comment il est possible d'adapter cette méthodologie au monde Android avec différents outils. Nous commencerons par une rapide présentation d'une bonne intégration continue Android. Nous verrons ensuite quels outils nous permettent de mettre en place cette intégration continue avec un focus tout particulier sur les tests. Enfin, nous explorerons  l'API mise en place par Google pour permettre aux développeurs d'interagir avec la console du Play Store et ainsi automatiser les livraisons Android."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Comment gagner de l’argent avec les tests E2E en JS",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 290,
"venue_id": "tobedefined",
"speakers": "Florent Berthelot, ",
"description": "Brendan Eich fait vraiment tout pour que les développeurs JS se fassent un max; il vient de sortir Brave, un navigateur qui rémunère les utilisateurs grâce aux pubs.\nPourquoi ne pas détourner ce système en live-codant un test E2E qui clique automatiquement sur des pubs ?\n\nQuitte à faire des tests autant s’amuser à les faire bien, alors ça sera l'occasion de découvrir les possibilités offertes par l'ES2105, les coroutines, les pages objects, Webdriver.io.\nD'ailleurs pourquoi Webdriver.io plutôt qu'un autre ?"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Bonnes pratiques d'architectures de Web API",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 291,
"venue_id": "tobedefined",
"speakers": "Stève Sfartz, ",
"description": "Proposer une Web API est un pré-requis en 2016. Ca tombe bien, les outils sont désormais matures et prêts à l'emploi. \n\nCe talk fait un tour d'horizon des principaux enjeux d'architectures des API Web, et surtout comment y répondre !\n\nAprès qq exemples de technologies candidates pour implémenter son API Web en Java, Node et Go, nous approfondirons comment :\n\n- Designer son API Web : approches api-first, code-first, IDE\n\n- Documenter son API Web : swagger and alternative\n\n- Implémenter son API Web en Java, Node et Go (10')\n\n- Sécuriser on API Web : authentification et autorisation\n\n- Protéger son API Web : rate limitation\n\n- Découpler/Scaler son API Web : pattenrs side-car / microservices \n\n- Tester son API Web : illustration avec runscope\n\n- Choisir son paradigme REST, RPC : performances, applications mobiles, flux complexes, et les approches des grands du Web (Google, Twitter, Facebook)"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "En 2016, j'me mets à GO, from ZERO to GO in an hour.",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 292,
"venue_id": "tobedefined",
"speakers": "Stève Sfartz, ",
"description": "En 2016, j'me mets à GO, from ZERO to GO in an hour.\n\nUne conférence d'introduction GO pour les développeurs Java, NodeJS et C# :\n\n- Les fondamentaux du langage : Code structure, Error handling, Templates, Routines, Channels,\n- Ce qui change : Exceptions, Generics, Heritage, \n- Ce qui reste vrai : gestion des dépendances, logs, \n- L'outillage : les IDE, Debugging, Tests, Documentation\n- Déployer : Standalone, PaaS, Docker,  12factor configuration\n- Réaliser des WebAPIs, JSON marshalling unmarshalling\n- Réaliser des Shells interactifs : \n- Persister ses données : In-memory/disk database\n- Retours d'expérience sur mes premiers MVP en go\n\nLa présentation sera illustrée au travers de projets opensource #golang communautaires (hugo, viper, cobra CLI) et personnels (answeringmachine, maretraite, smartproxy), see https://github.com/ObjectIsAdvantag.\n\nAttention : Présentation très orientée suite à laquelle il est probable que vous ne souhaitiez plus toucher à un autre langage que #golang."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Introduction Devops, de l'idée à la réalité !",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 293,
"venue_id": "tobedefined",
"speakers": "anas ameziane, Anthony ARNAUD",
"description": "Actuellement, les entreprises, quelque soit leur secteur d'activité, ont recourt à différents services informatiques. Cependant le cloisonnement des équipes ne permet plus de répondre à leurs besoins en terme de réactivité et de productivité. La démarche DevOps fournit un ensemble de pratiques favorisant la synergie entre les équipes qui est l'une des clés du succès.\n\nQue se cache-t-il derrière le terme DevOps ? Et pourquoi nous devrions adopter cette démarche ?\n\nDurant cette conférence nous allons parcourir tous les concepts de base et finir par une démo de déploiement automatique \"from scratch\" d'une application web ( loadbalancer et monitorer )."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "A quoi peut servir la programmation fonctionnelle ?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 294,
"venue_id": "tobedefined",
"speakers": "Loic Knuchel, ",
"description": "Si j'étais commercial je dirais que la programmation fonctionnelle permet de coder plus vite et sans bugs. Étant dév, je vais plutôt te montrer pourquoi tu devrais t’intéresser à ce paradigme de programmation.\n\nOn partira des bénéfices de la programmation fonctionnelle pour passer en revue ces grands principes."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Scala, refactoring fonctionnel",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 295,
"venue_id": "tobedefined",
"speakers": "Loic Knuchel, ",
"description": "On entend de plus en plus parler de programmation fonctionnelle. Le concept peut sembler intéressant mais on ne sait pas toujours comment s’y mettre. Et puis il y a beaucoup de nouveaux concepts avec des mots compliqués qui ne facilitent pas la compréhension.\n\nPour comprendre ce qu’est la programmation fonctionnelle, une bonne fois pour toutes, je propose de refactorer un code impératif traditionnel en code fonctionnel. J’en profiterai pour introduire les différents concepts de base et voir pourquoi ce paradigme élimine certaines catégories de bugs et rend le code plus modulaire."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Scala, plus de typage pour moins de bugs",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 296,
"venue_id": "tobedefined",
"speakers": "Loic Knuchel, ",
"description": "C'est bien connu, avoir des données typées permet d’identifier et de supprimer des erreurs beaucoup plus tôt. Mais qu'en est-il des types primitifs (Int, String, Bool...) ???\n\nS'il t'es déjà arrivé de retrouver un email dans un champ nom, d'inverser 2 booléens ou d'additionner des choux avec des carottes, alors félicitations tu es bien humain !\n\nMais ne pourrait-on pas éviter cette catégorie d’erreurs avec plus de typage ?\n\nIl suffirait de définir et d'utiliser de nouveaux types pour éliminer complètement ces erreurs : Email, FirstName, ValidEmail, UserId... Bien sûr, tous ces nouveaux types ne doivent pas venir complexifier inutilement notre code et c’est là que repose le challenge.\n\nVoyons comment mettre en place une stratégie de typage avancée avec Scala et Play Framework afin de rendre nos applications plus robustes."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Programmation fonctionnelle en JavaScript",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 297,
"venue_id": "tobedefined",
"speakers": "Loic Knuchel, ",
"description": "La programmation fonctionnelle n’est pas réservée à certains langages dits “fonctionnels”. C’est avant tout des principes de programmation qui peuvent être utilisés dans n’importe quel langage (plus ou moins facilement). Heureusement, JavaScript est un langage souple et s’adapte très bien à ce type de programmation.\n\nVoyons comment rendre notre code JavaScript plus fonctionnel, pour augmenter sa productivité et limiter les bugs."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Comment rater sa startup…",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 298,
"venue_id": "tobedefined",
"speakers": "Loic Knuchel, ",
"description": "99% des startups se plantent !\n\nLe chiffre est probablement faux mais l'idée est là !\n\nPourquoi ?\n\nEn partie parce que tous nos réflexes se sont forgés dans un environnement très différent de celui des startups : \"Les startups sont aux entreprises ce que la physique quantique est à la physique classique\".\n\nVoici donc mon retour d'expérience après avoir planté 2 startups de ce qu'il faut faire pour être sûr de foncer droit dans le mur !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Ionic2 quick start",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 299,
"venue_id": "tobedefined",
"speakers": "Loic Knuchel, ",
"description": "Avec Ionic 1, n'importe quel développeur web (enfin, front... enfin, Angular...) peut développer rapidement et facilement une application mobile tout à fait correcte.\nAvec la version 2, Ionic amène beaucoup de nouveautés dont : de meilleures performances, un meilleur design et une architecture/code plus simple et plus proche des standards JavaScript (ou TypeScript).\n\nNous ferons le tour des principes et fonctionnalités essentiels pour construire son application avec Ionic2."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Challenge Mindstorms - Tester votre capacité à développer",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": " Objects connectés, IoT, Robotique",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 300,
"venue_id": "tobedefined",
"speakers": "Aurélien Morvant, Sylvain Révéreault",
"description": "Nous vous proposons lors de ces quelques heures de relever un défi:\n- Nous fournissons le robot\n- Nous fournissons le challenge.\n- Vous fournissez les cerveaux\nCoder dans le langage que vous souhaitez, Python, Java ou LabView (Logiciel EV3 Lego), C++, NodeJS, ...,  notre robot mindstorms.\nMesurez-vous à d'autres développeurs, mesurer vous contre le temps qui court.\nEntraîner vous avec votre langage préféré, le jour J, il vous faudra faire preuve d'ingéniosité.\nAu final, nous verrons si le langage est plus fort que l'algorithmique !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "La modularisation avec ES6 : à chaque besoin son outil",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 301,
"venue_id": "tobedefined",
"speakers": "Jordane Grenat, ",
"description": "Depuis ES6, JavaScript possède des modules natifs que je vous propose de découvrir. Ceux-ci entraînent l'apparition de nouvelles problématiques et de nouveaux outils pour découpler proprement son application web. \n\nLaissons RequireJS et Browserify à leur retraite bien méritée et accueillons à bras ouverts les nouveaux arrivants : webpack, JSPM et Rollup ! \n\nBien que très souvent opposés, chaque outil couvre un périmètre précis ; je vous propose d'étudier, en fonction des caractéristiques de votre projet (la petite bibliothèque utilitaire, le site personnel, la webapp monolithique) ces différentes solutions et d'identifier celle qui sera la plus appropriée.\n\nCette conférence ne demande aucun prérequis puisque nous définirons ensemble les concepts clés mis en oeuvre."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Oubliez les migraines, faîtes de l'asynchrone... synchrone !",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 302,
"venue_id": "tobedefined",
"speakers": "Jordane Grenat, ",
"description": "Tout développeur JavaScript – même celui qui n'ose pas se l'avouer – a subi un jour le callback hell à cause de l'asynchrone. Aujourd'hui, de nouveaux outils du langage nous permettent de gérer bien plus élégamment nos appels asynchrones, à tel point qu'on en vient à faire de l'asynchrone... synchrone ! \n\nJe vous propose de découvrir cela au travers d'un live coding en partant de la code base cauchemardesque héritée du stagiaire débutant le JavaScript – si cela ne vous évoque rien, vous faites parti d'une minorité miraculée ! Nous utiliserons les promesses, les générateurs et les coroutines pour l'améliorer progressivement, en notant au passage les pièges auxquels il ne faut pas succomber..."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Adoptez la DISC'O Attitude dans vos équipes",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 303,
"venue_id": "tobedefined",
"speakers": "Nicolas BULTEAU, Sylvain Révéreault",
"description": "DISC est un outil qui permet d'améliorer la communication entre les personnes. \nNous faisons tous l'erreur de parler aux autres comme on aimerait qu’ils nous parlent ... alors qu'il conviendrait de leur parler comme ils aimeraient qu’on leur parle.\nL'outil DISC est issu des travaux du Dr Marston, il permet de \"classifier\" les styles de communication et le comportement des individus de façon pragmatique.\nDISC définit des profils (Dominant, Influent, Stable et Consciencieux). Pour chaque profil, DISC décrit les comportements types dans les situations de stress ainsi que leurs moteurs, leurs forces, leurs freins.\nVenez découvrir avec nous les étapes de la mise en place de ce type d'outil dans une équipes de développement."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "ES6 au service de la Developer Experience",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 304,
"venue_id": "tobedefined",
"speakers": "Jordane Grenat, ",
"description": "Après des années de stagnation, ES6 apporte enfin de tout nouveaux outils au langage JavaScript ! Fort de longues années d'expériences, ceux-ci sont très orientés vers le confort du développeur – certains parlent de *Developer Experience* (DX).\n\nNous verrons que grâce à ces nouveautés, il est possible d'augmenter énormément la lisibilité et la maintenabilité de votre code. Je vous propose pour cela de partir d'un projet en ES5, et de remplacer progressivement des éléments de notre projet en exploitant les nouveautés proposées par ES6, dont les promesses, les modules natifs et les fat arrow functions.\n\nAucun prérequis n'est nécessaire, j'expliquerai chaque nouveau concept avant de l'utiliser. De même, je vous montrerai comment se servir de Babel pour rendre ces outils accessibles dans la très grande majorité des navigateurs actuels.\n\nD'un code propre mais difficilement compréhensible sans la présence de commentaires, nous arriverons peu à peu à un code bien plus lisible – donc plus maintenable ! – et de meilleure qualité."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Un a priori ou une idée reçue sur Scala, venez juger par vous-même!",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 305,
"venue_id": "tobedefined",
"speakers": "Fabrice Sznajderman, ",
"description": "Vous avez dès a priori sur l'écosystème Scala. On vous a dit =\"Scala, ce n'est pas (encore) ça\" ou \"Scala, aucun intérêt\", mais vous n'avez jamais vraiment eu le temps de tester ou vérifer. Malgré tout vous vous posez des questions et rester dubitatif.\n\nAlors cette session est faite pour vous! Venez! :)\n\nJe propose de faire un tour d'horizon des fonctionnalités clefs du language qui peuvent faire la différence. Je vous présenterai également comment l'outil de build associé au language peut améliorer votre travail au quotidien et enfin je ferai un focus sur les librairies de test.\n\nAprès cette session, vous aurez une idée précise et un avis objectif sur cet écosystème."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "// TODO Implémenter le modèle de l’entreprise [de service] de demain",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 306,
"venue_id": "tobedefined",
"speakers": "Carl Azoury, ",
"description": "Quelle est la fonction première d’une entreprise ? L’entreprise libérée, est-ce un mythe ? Comment conserver une culture startup malgré la croissance ? Et d’ailleurs, pourquoi faire de la croissance ? Comment créer une culture de l’innovation ? A quoi sert un manager ? Qu’est ce qu’une entreprise horizontale ? Quelle place pour le plaisir ? Quelle place pour le développement personnel et culturel ?\n\nConstruire l’entreprise où nous aurions aimé être consultants, telle fut notre motivation à la création de notre structure. Mais cela ne suffit plus ! Nous sommes entrés dans une période disruptive sans précédent. L’innovation est une question de survie, qu’elle soit technologique, managériale ou structurelle. \n\nDans ce talk nous focaliserons sur l’organisation de l’entreprise, son modèle, la notion de performance et la transformation de ce qu’est l’emploi, de ce qu’est une carrière. De la startup à la société de service l’écart est grand. D’ailleurs les signes de « coolitude » qu’affichent certaines d’entre elles pour tenter de leur ressembler ne trompent plus personne !\n\n\nNous répondrons à toutes ces questions par des cas concrets, mais aussi par une présentation de notre vision long terme et du chemin qu’il nous reste à parcourir. Autant d’éléments de réflexion et de cross pollinisation"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Rails 5, des graphs, et des Pokémon",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 307,
"venue_id": "tobedefined",
"speakers": "Charly Maupetit, ",
"description": "A l'occasion des 20 ans de la série Pokémon, et accessoirement de la bêta de Ruby on Rails 5, découvrons les nouveautés de cette version, comment utiliser une base orientée graph (neo4j) pour grapher nos données (des Pokémons donc) et créer un système d'échange temps réel via le support natif des websockets dans Rails 5."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Internet : Vie privée et données publiques",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 308,
"venue_id": "tobedefined",
"speakers": "Brendan Abolivier, Gilles Biannic",
"description": "Avec l'évolution toujours plus importante des technologies de l'information, et dans un contexte d'espionnages et de mises sur écoute autant par les gouvernements que par les grands industriels, la protection de notre vie privée devient de plus en plus compliquée.\n\nDans ce cadre, Brendan Abolivier (contributeur et ancien stagiaire chez Cozy) et Gilles Biannic, tous deux étudiants, vous proposent une conférence au cours de laquelle ils dresseront un état des lieux de la situation actuelle du stockage et du traitement des données personnelles, et présenteront des solution destinées à ceux désireux de protéger ces mêmes données personnelles."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Déployer une application et son service broker dans Cloud Foundry",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 309,
"venue_id": "tobedefined",
"speakers": "Hung Bui, ",
"description": "Ce Lab vous permet de (re)découvrir les principe du PaaS avec Cloud Foundry. En plus du déploiement d'une application \"classique\", nous allons également implémenter et mettre en ligne rapidement un service broker et le déployer dans Cloud Foundry. C'est surtout utile quand vous voulez lancer un MVP (Minimum Viable Product)."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Suivi des vulnérabilités dans les dépendances",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 310,
"venue_id": "tobedefined",
"speakers": "Maxime OLIVIER, Georges Bossert",
"description": "Les applications dépendent très souvent de nombreuses bibliothèques tierces. Ces bibliothèques disposent elles-mêmes de leurs propres dépendances. D'un point de vue sécurité, l'ajout d'une dépendance à son projet peut constituer un risque de sécurité. En effet, la présence d'une vulnérabilité dans une fonctionnalité utilisée (ou pas) d'une bibliothèque tierce peut très vite se propager à son application. Pour cette raison, il est important d'assurer le suivi des vulnérabilités identifiées dans ses dépendances. De cette manière, un correctif ou une mise à jour vers une version supérieure de la dépendance pourra être réalisée au plus vite.\nMalheureusement, les développeurs opensource ne disposent pas d'une solution simple et efficace permettant le suivi des vulnérabilités identifiés dans les dépendances de leurs applications. Les plus courageux réalisent donc une veille de sécurité pour adresser cette problématique. Ils surveillent les bulletins de sécurité et s'inscrivent aux mailling-lists (si elles existent) des développeurs des bibliothèques tierces. Malheureusement, des vulnérabilités peuvent également être introduites par les dépendances implicites (i.e. les dépendances de dépendances) de son application. Celles-ci peuvent être très nombreuses ce qui tend à rendre fastidieuse toute veille manuelle et exhaustive. L'identification des dépendances vulnérables doit donc être automatisée. Quelques initiatives ont commencé à apparaître dans l'éco-système des logiciels opensource. L'une des plus connues est celle de l'OWASP qui propose un plugin-maven à cet effet. Il permet d'obtenir la liste des vulnérabilités présentes dans les dépendances de son application Java. D'autres initiatives existent à l'image de Snyk.io qui propose le suivi des vulnérabilités présentes dans les dépendances d'une application NodeJS. Malheureusement, ces quelques initiatives souffrent de plusieurs limitations.  Par exemple, ces solutions ne supportent souvent qu'un seul langage, n'exploitent qu'une seule base de vulnérabilités et se limitent à l'identification des vulnérabilités présentes dans les dépendances directes et explicites.\nFort de ces constats, nous avons développé une solution opensource pour aider les développeurs d'applications à veiller sur leurs dépendances. Elle agrège plusieurs sources de données pour rechercher le plus efficacement possible d'éventuelles nouvelles vulnérabilités dans vos dépendances. La solution développée propose un suivi en continu des résultats et leurs partages entre une bibliothèque et ses utilisateurs.\nLa présentation s'attachera à présenter ces outils ainsi que les différentes sources de données de vulnérabilités connues pouvant être exploitées à cet effet. Les différents standards utilisés pour décrire une vulnérabilité seront également introduits. Le coeur de la présentation portera sur la description d'un outil opensource de suivi des vulnérabilités présentes dans les dépendances de son projet. Pour conclure, une démonstration de ces principales fonctionnalités sera réalisée."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Analysez vos Séries Temporelles avec WarpScript #JustOpenSourced",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": " Objects connectés, IoT, Robotique",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 311,
"venue_id": "tobedefined",
"speakers": "Horacio Gonzalez, Sébastien Lambour",
"description": "La collecte, le stockage et l'analyse de données issues de capteurs confronte les développeurs à un triple challenge : \n- La performance: supporter un fort niveau d'ingestion\n- L'analyse: résonner avec des séries temporelles ne se ferra pas en SQL\n- La sécurité: au centre de la solution\n\nVenez découvrir comment utiliser WarpScript le langage dédié à l'analyse de Séries Temporelles.\nPréparez-vous à du live-coding avec des données collectées dans une pure tradition DIY (téléinfo, domotique, distributeur de bonbons connecté)"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Lego, Tagada, Data et Arduino : projet gourmand au StartupWeekEnd Brest",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": " Objects connectés, IoT, Robotique",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 312,
"venue_id": "tobedefined",
"speakers": "Horacio Gonzalez, Sébastien Lambour",
"description": "A chaque édition du Startup WeekEnd, une équipe DIY monte un proto qui partage la vie des startupers durant 54H.\nLors de l'édition 2016 nous avons développé un distributeur de fraises Tagada qui Tweet la consommation individuelle de bonbon des startupers.\nUne balance culinaire hackée, pilotant une potence en Lego qui ouvre le bol à bonbons, les données stockées avec Warp10 et un Wall affichant le profil de consommation des startupers les plus gourmands !\n\nTous les ingrédients sont là pour rendre la gourmandise virale."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Warp10 - Collectez, stoquez et analysez vos Séries Temporelles #JustOpenSourced",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 313,
"venue_id": "tobedefined",
"speakers": "Horacio Gonzalez, Sébastien Lambour",
"description": "La collecte, le stockage et l'analyse de données issues de capteurs confronte les développeurs à un triple challenge : \n- La performance: supporter un fort niveau d'ingestion- L'analyse: résonner avec des séries temporelles ne se ferra pas en SQL\n- La sécurité: au centre de la solution\n\nWarp10 a été créé pour répondre à ce challenge :\n* déployer un backend de collecte/stockage avec Docker, \n* stocker des données en HTTP, WebSocket ou encore le démon de collecte Sensision,\n* analyser vos données avec WarpScript,\n* découvrir les  web components d'édition de script et visualisation de données."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Test Driven Infrastructure avec Docker",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 314,
"venue_id": "tobedefined",
"speakers": "Mario Loriedo, ",
"description": "Nous sommes habitués à écrire nos applications par petits incréments, guidés par les tests et à les valider avec des outils d’intégration continue. Mais nous n'avons pas encore ces habitudes quand il s'agit de développer nos infrastructures.\n\nOr, comme pour le développement de logiciel, faire du *test first* nous permettrait d'être plus efficaces. Avec des tests automatisés nous pourrions faire évoluer notre infrastructure le coeur léger. Et avec les outils de CI nous pourrions automatiser les tests et les déploiements en gagnant du temps et de la qualité.\n\n**Docker** a le mérite d'avoir introduit le concept de *Infrastructure as Code* chez les développeurs : nous pouvons désormais décrire nos environnements de runtime à coup de Dockerfiles. **Docker-unit**, un framework de test pour Dockerfiles, permet d’écrire facilement des tests pour notre infrastructure. De là à faire du *test first* et du déploiement continu pour notre infrastructure il n’y a qu’un pas…"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Docker pour développeurs : 5 conteneurs pour 5 langages",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 315,
"venue_id": "tobedefined",
"speakers": "Mario Loriedo, ",
"description": "De *Rust* à *Go*, de *Haskell* à *Swift*, en passant par *ArnoldC* sans oublier la *jshell* de la JDK9. Nous ferons le tour de ces cinq langages, à mi-chemin entre le sérieux et l'humour, tout en réalisant le plus simple des kata : fizzbuzz.\n\nEn même temps, pour accélérer la transition d'un langage à un autre, nous utiliserons les *language stacks* Docker. Ces images mettent à disposition des développeurs des environnements de développement pré-configurés. Nous verrons comment les utiliser pour chacun de ces cinq langages et nous nous arrêterons sur les patterns d'utilisation de Docker comme outil de build et de run d'une application."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Polymer dans la vraie vie",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 316,
"venue_id": "tobedefined",
"speakers": "Horacio Gonzalez, ",
"description": "Ça fait deux ans que je fais des talks de Polymer à droite et à gauche, et une des questions qu'on m'a le plus posé c'est \"mais, ça marche dans la vraie vie ?\"\n\nJe répondais toujours oui, je donnais des exemples, mais j'avais toujours la frustration de ne pas pouvoir le monter car les applications que je fais étaient réservées à nous clients.\n\nMais aujourd'hui notre plateforme Warp 10 est open source, et je peux enfin parler de ce que je fais depuis deux ans, coder des applications web complètement basés sur des composants web Polymer, des applications fonctionnelles, utilisées dans tous les navigateurs y que se combinent avec d'autres technologies. Bref, du Polymer dans la vraie vie."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Introduction à la cryptographie illustrée par le cas HTTP2",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 317,
"venue_id": "tobedefined",
"speakers": "Maxime OLIVIER, Georges Bossert",
"description": "La sécurité des communications est un problème historique pour lequel les premières solutions sont apparues dès l’antiquité. La nature des besoins a évolué en même temps que les moyens de communication générant ainsi une variété d’algorithmes et de processus de protection des échanges. Nous proposons de présenter un bref historique des besoins et des solutions (stéganographie, cryptographie, fonction de hachage, etc.) avant d’expliquer dans le détail les principes de la cryptographie moderne (cryptographie symétrique vs asymétrique, fonction de hachage et les principaux algorithmes).\nAfin de concrétiser la présentation et d’associer ces solutions à un cas concret, nous proposons de présenter l’utilisation des différents algorithmes dans le cadre de la protection d’un protocole amené à devenir l’un des voire le protocole le plus utilisé : HTTP2 et sa couche de protection TLS."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Les vulnérabilités Web : concepts, découverte, exploitation et protection",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 318,
"venue_id": "tobedefined",
"speakers": "Maxime OLIVIER, Georges Bossert",
"description": "L’exposition ainsi que la variété des technologies existantes font des applications web une cible de choix pour les attaquants. De plus, la nature des services rendus exposent ces applications à des vulnérabilités spécifiques et ayant des impacts importants en cas d’exploitation (déni de service, prise de contrôle du serveur, vol d’identité, accès à des données confidentielles, etc.). Ces vulnérabilités constituent des risques importants pour les applications et leurs utilisateurs.\nNous proposons de présenter les principales vulnérabilités applicables au contexte des applications Web (injection SQL, XSS, injection de fichier, injection de code, CSRF, cookie de session trop exposé, etc.). Outre la présentation de la vulnérabilité en elle-même, nous présenterons pour chacune, le moyen de les détecter (par analyse du code source et/ou par test de l’application), un exemple d’exploitation ainsi que les bonnes pratiques qui permettent de protéger son application."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Android Auto : Rolling Droid Gather No Moss",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": " Objects connectés, IoT, Robotique",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 319,
"venue_id": "tobedefined",
"speakers": "Damien Cavaillès, ",
"description": "Android Auto, c'est avant tout Android qui se déploie vers un nouvel horizon. Après Android Wear, la conquête d'Android Everywhere s'attaque à l'automobile. Et C'est plus que jamais d'actualité. Ford a annoncé au dernier CES que tous ses véhicules 2017 en seraient équipés. Nous ferons donc le tour de la question concernant Android Auto, ce que ça signifie pour les utilisateurs et pour les développeurs. On verra une mise en action de l'outil avec un cas concret #UnCasProd"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Nearables : The Eddystone Quest",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": " Objects connectés, IoT, Robotique",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 320,
"venue_id": "tobedefined",
"speakers": "Damien Cavaillès, ",
"description": "iBeacon était censé ouvrir le monde des objets connectés par la proximité, résoudre les problèmes de geolocalisation indoor et tuer le NFC. Aujourd'hui, il y a du NFC dans les iPhones et la proximité c'est toujours pas ça.\nEddystone est le nouveau standard qui s'impose aujourd'hui. A l'instar d'iBeacon, il est bien foutu et ouvre à des utilisations concrètes et efficace. Appuyé par la Proximity Beacon API, il ouvre beaucoup plus de potentiel !\nAlors comment marche Eddystone ? Qu'est-ce qu'on peut en faire ? Comment mettre tout en oeuvre avec la Proximity API ? Comment rendre le monde physique plus connecté et virtuellement découvrable ?\nVous saurez tout dans ce talk !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Découvrez la programmation fonctionnelle avec JavaScript !",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 322,
"venue_id": "tobedefined",
"speakers": "David Sferruzza, ",
"description": "La programmation fonctionnelle est un paradigme de programmation très intéressant et puissant. Cependant il est souvent difficile pour les débutants d'appréhender et de prendre du recul sur les différents concepts qui la composent, notamment car la plupart des ressources imposent l'apprentissage d'un nouveau langage de programmation (comme Haskell).\n\nMon objectif ici est d'expliquer les concepts fondamentaux de la programmation fonctionnelle (comme la transparence référentielle, les fonctions d'ordre supérieur, l'évaluation paresseuse et l'immuabilité) et de montrer comment les utiliser immédiatement avec JavaScript dans le but d'avoir un code plus maintenable. Je montrerai quelques méthodes de l'API native `Array` (comme `map`, `filter` et `reduce`) pour illustrer ces concepts.\n\nJ'ai envie de donner envie aux gens d'en apprendre plus sur la programmation fonctionnelle, et qu'ils réalisent qu'elle peut les aider à produire du meilleur code, même dans les langages \"classiques\". Cette conférence vise principalement les débutants, et veut leur donner de l'intuition sur la manière dont \"penser programmation fonctionnelle\" peut les aider au quotidien."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Gérer les erreurs avec l'aide du système de types de Scala !",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 323,
"venue_id": "tobedefined",
"speakers": "David Sferruzza, ",
"description": "Certaines fonctions de nos programmes peuvent échouer à calculer une valeur de retour. Plutôt que d'utiliser des exceptions, il est possible de tirer partie du système de types de Scala pour gérer les erreurs de manière plus fiable et lisible.\n\nNous verrons comment utiliser des ADT (Algebraic Data Types) comme `Option`, `Try` et `Either`, ainsi que `disjunction` et `validation` de [Scalaz](https://github.com/scalaz/scalaz). On regardera aussi la bibliothèque [Rapture](http://rapture.io/) et ses \"modes\" qui offrent la possibilité *à l'appelant* de choisir de quelle manière il veut encapsuler les éventuelles erreurs.\n\nLa gestion des erreurs est bien moins compliquée lorsque le compilateur peut nous aider !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Gérer les erreurs avec l'aide du système de types de Scala !",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 324,
"venue_id": "tobedefined",
"speakers": "David Sferruzza, ",
"description": "Certaines fonctions de nos programmes peuvent échouer à calculer une valeur de retour. Plutôt que d'utiliser des exceptions, il est possible de tirer partie du système de types de Scala pour gérer les erreurs de manière plus fiable et lisible.\n\nNous verrons comment utiliser des ADT (Algebraic Data Types) comme `Option`, `Try` et `Either`, ainsi que `disjunction` et `validation` de [Scalaz](https://github.com/scalaz/scalaz). On évoquera aussi rapidement la bibliothèque [Rapture](http://rapture.io/) et ses \"modes\" qui offrent la possibilité *à l'appelant* de choisir de quelle manière il veut encapsuler les éventuelles erreurs.\n\nLa gestion des erreurs est bien moins compliquée lorsque le compilateur peut nous aider !"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Le temps : ennemi et ami du développeur",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 325,
"venue_id": "tobedefined",
"speakers": "Charles Desneuf, ",
"description": "Le temps est souvent un des grand oubliés lors de la création de logiciel. Il est souvent tentant de développer ses propres solutions pour le gérer lorsque l'on ne pense pas à sa complexité, ou même de ne pas le prendre en compte lors du développement alors qu'il peut permettre, une fois bien compris, de créer des applications au fonctionnement beaucoup plus agréable pour l'utilisateur. Au cours de cette présentation nous verrons quelques exemples de cette complexité ainsi qu'une réflexion sur la mise en concurrence de deux utilisateurs d'une application. Par ailleurs, nous nous pencherons sur la possibilité offerte par immutabilité du passé : l'event sourcing."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "React Native le meilleur des deux mondes",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 326,
"venue_id": "tobedefined",
"speakers": "Adrien Ogor, Hadrien Bourgogne",
"description": "Quand on demande à deux développeurs Web de concevoir une application mobile, une réponse s'impose : **React Native**.  \n\nNous montrerons comment React Native à su joindre le meilleur des deux mondes : l'accessibilité du **JavaScript** avec les **performances des langages natifs** des plateformes mobiles.  \n\nEnsemble, nous verrons comment il est possible, dès aujourd'hui, de **développer** des applications natives tout en mutualisant le code JavaScript entre iOS et Android."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "MeteorJS: \"MongoDB everywhere\"",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 327,
"venue_id": "tobedefined",
"speakers": "Yann Danthu, ",
"description": "**MeteorJS**, plus qu’un framework, est une plateforme de développement Fullstack Javascript qui repose sur plusieurs principes tel que « *latency compensation* », « *database everywhere* » ou encore « *data on the wire* ».\n\nAttardons-nous sur « *Database everywhere* », ou plutôt « *MongoDB everywhere* », et explorons comment **MongoDB** se trouve accessible à la fois côté serveur et côté client. Petit survol des éléments qui gravitent autour tel que l'outillage, le requêtage, le publish/subscribe, sans oublier la sécurité, et ce que cela apporte en terme de développement d'applications."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Service Discovery et haute disponibilité dans vos containers Docker avec Consul et NGINX",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 328,
"venue_id": "tobedefined",
"speakers": "Pierre Le Roux, ",
"description": "Comment consommer un service sans se soucier du container qui l'expose ou le serveur sur lequel il se trouve ? Comment gérer automatiquement l'indisponibilité d'un service et garantir des redéploiements à chaud sans discontinuité d'activité ?\nNous verrons comment NGINX et Consul, bien couplés, nous facilitent la communication entre nos containers en assurant DNS, load balancing, détection de lancement de containers et indisponibilités."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Node.JS : Se passer de mongoose sans insérer n'importe quoi dans Mongo",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Langages",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 329,
"venue_id": "tobedefined",
"speakers": "Pierre Le Roux, ",
"description": "En Node.JS, si on veut interagir avec un MongoDb, on tombe rapidement sur Mongoose qui s'avère parfois compliqué et lourd sur des modifications spécifiques.\nEn validant le schéma en entrée du service Rest, avec un peu de conversion de données, on peut s'en passer sans prendre trop de risques sur la qualité des données."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "20 years of code: The ultimate developer discography",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 330,
"venue_id": "tobedefined",
"speakers": "Sébastien Lambour, Audrey Neveu",
"description": "Il est temps de balayer 20 ans de code.. en musique. Le code est rempli de joies, de peines ou encore d'histoires de... brutes, de déceptions et de trahison.\nVous y trouverez les clés pour ne jamais finir <muse>Dead Inside</muse>"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "REST from zero to hero in 45 minutes",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 331,
"venue_id": "tobedefined",
"speakers": "Manuel Boillod, Antoine Richard",
"description": "Venez découvrir - ou redécouvrir ! - les différents ingrédients qui sont a l’origine d’une bonne API.\n\nNous présenterons la transformation d’une API Web fictive (d'une conception assez discutable ;-) ) en une API REST vraiment user-friendly. Chaque étape sera l’occasion d’introduire un concept ou une bonne pratique supplémentaire en partant des bases de REST jusqu’aux sujets avancés tels que le versioning ou l’hypermédia.\n\nVous sortirez de cette session avec une vision claire des concepts cachés derrière le terme \"REST\"."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Elasticsearch pour le breton",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 332,
"venue_id": "tobedefined",
"speakers": "Lucian Precup, ",
"description": "Cette conférence est la version bretonne du talk \"Elasticsearch pour le français\" :-). Elasticsearch est une technologie très puissante pour les cas d'utilisation \"moteur de recherche\" ou \"analyse de données\". Au cœur de la technologie, Lucene gère ce qu'on appelle l'analyse du texte. Nous traitons la situation d'une base de travail en ~~français~~ breton. Nous montrons, de manière exhaustive, quels sont les dessous de l'analyse linguistique d'un texte et quels leviers nous pouvons utiliser avec Elasticsearch. Nous allons jusqu'à identifier les limites et implémenter notre propre filtre sous forme de plugin Java. Nous abordons également toutes les problématiques d'une indexation multi-langue : patterns d'architecture, astuces, conseils et beaucoup de retours d'expérience."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "les enjeux de la cybersécurité dans le cadre des transformations digitales",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 333,
"venue_id": "tobedefined",
"speakers": "Ali Bekkali, ",
"description": "Dans un ère de transformation digitale, d’exposition de services et d’ouverture du SI au monde numérique, la cybersécurité constitue plus que jamais un enjeu majeur pour nos clients. En effet, nombreuses sont les organisations en 2015 qui ont été victimes de Cyberattaques et de Hactivismes engendrant des conséquences catastrophiques pour leur business et leur image de marque. \nLe but de cette conférence est de présenter, un panorama de la cybercriminalité, les enjeux de la cybersécurité ainsi que les mesures à mettre en place pour la prévention du risque IT"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Sécurité dans les développements et Audit Statique Sécurité de code source",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 334,
"venue_id": "tobedefined",
"speakers": "Ali Bekkali, ",
"description": "La sécurité applicative constitue une pierre angulaire de la sécurité du SI. En effet, selon le Gartner, 75% des attaques sont applicatives. Le but de ce talk est de vous présenter notre framework d'analyse sécurité du code source basé sur Sonar et permettant de détecter le Top 10 OWASP et le Top 25 NIST"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Si t'as pas Open Sourcé avant 40 ans, c'est que t'as raté ta vie de développeur!",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Keynote",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 335,
"venue_id": "tobedefined",
"speakers": "Sébastien Lambour, ",
"description": "L'Open Source, truc de hippy des années 90 est devenu LE lifestyle de toute tech company. \nMais alors comment s'y prendre ? Beaucoup de développeurs en ont violemment souffert.\nVous ne voulez pas subir le même sort ? Je vous dévoilerai avec impertinence tous les secrets de cette savante alchimie."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Stucturer les données non-structurées",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 336,
"venue_id": "tobedefined",
"speakers": "Laurent Doguin, ",
"description": "Les promesses d'agilité ou de pouvoir se passer de schéma ne sont jamais loin quand on parle de base de donnée NoSQL. Et oui tout ceci est vrai. On peut stocker des données non-structurées très facilement. Stocker des données est une chose, les utiliser en est une autre. Et il faudra bien avoir une forme de structure à ce moment la.\nPlusieurs solutions sont possibles. Dans ce talk on se posera les bonnes questions en commençant par le modèle de donnée et les patterns qui peuvent aider à éviter certains pièges comme les point chauds et les accès concurrents. Puis viennent les nouveaux langages de requêtes SQL-like qui permettent de requêter ces données non structurées ou semi-structurées de manière plus familière."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Laissez vos objets connecté se parler entre eux, sans internet",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": " Objects connectés, IoT, Robotique",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 337,
"venue_id": "tobedefined",
"speakers": "Laurent Doguin, ",
"description": "Le monde de l'IoT doit s'affranchir des serveurs centraux. Ca commence doucement, mais on m'y est pas encore. Idéalement un objet situé à porté de wifi d'un autre objet ne devrait pas avoir à passer par un serveur sur internet pour communiquer. C'est ce que je vais vous montrer pendant ce talk.\n\nJ'expliquerai comment j'ai crée une simple application de chat comme cas pratique. Tout les objets qui exécuteront l'appli pourront se découvrir automatiquement et échanger des données à condition d'être sur le même réseau."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Un exemple concret d'RxJava avec Ratpack",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Java, JVM, Javas SE/EE",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 338,
"venue_id": "tobedefined",
"speakers": "Laurent Doguin, ",
"description": "RxJava c'est ce truc super cool dont beaucoup de dev parlent en ce moment. Mais la plupart du temps quand on lit quelque chose sur le sujet, il est difficile de se faire une idée concrète. Bien sur les exemples isolés sont super intéressants pour comprendre un opérateur en particulier, mais il est toujours difficile de mettre ça en perspective avec une vrai appli.\nDans ce talk je présenterai une application simple pour stocker, indexer et rechercher des fichiers. On verra quels avantages il y a à utiliser RxJava et Ratpack. Rien de bien compliqué ou avancé, mais quelque chose de concret."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Select Distinct(feature) From database Where type In (\"SQL\", \"NoSQL\")",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "BigData et Analytics",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 339,
"venue_id": "tobedefined",
"speakers": "Laurent Doguin, ",
"description": "On a maintenant l'habitude du NoSQL dans l'industrie. Mais parfois il n'est pas toujours évident de savoir ce que l'on perd ou l'on gagne en choisissant le SQL ou NoSQL. Il est même encore moins évident de savoir dans quels cas ils sont complémentaires.\n\nPendant ce talk je parlerai des principales différences d'architecture qui donnent des capacités DISTINCT à ces bases de données. Je parlerai aussi des impacts que les choix et compromis effectués peuvent avoir sur la couche applicative."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Présentation de l'environnement projets (\"forge\") mis en place à Net-ng",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Cloud, DevOps, Outils",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 340,
"venue_id": "tobedefined",
"speakers": "Alain Poirier, ",
"description": "[Net-ng](http://www.net-ng.com) est une société de 25 personnes, spécialisée dans le développement \"à façon\"\nd'applications Web.\n\n\nCette présentation est un retour d'expérience sur le remaniement complet de notre\nsystème d'information orienté projets, effectué au cours de l'année 2015. Nous y\naborderons aussi bien les aspects techniques des différents constituants de ce\nnouveau SI que les différents workflows et changements méthodologiques qui en ont\ndécoulé.\n\nAprès une courte introduction des pré-requis que nous nous étions fixés, à savoir :\n\n - un objectif d'augmentation de la qualité et de la productivité de nos développements\n - une utilisation exclusive d'outils Open-Source\n - un déploiement \"on-premise\" c'est à dire sur nos serveurs et non avec des\n   solutions en SAAS\n - une modernisation du SI, aussi bien dans les technologies employées que dans\n   l'ergonomie des différents constituants ou les workflows utilisés\n\nnous présenterons les différents sous-systèmes constituant le SI ainsi que leurs\ninteractions :\n\n - gestion des sources autour de Git\n - code review et merge requests\n - intégration continue avec des workers Docker\n - déploiement continu dans un PAAS d'intégration interne basé sur Docker\n - outil orienté développement Agile SCRUM (User stories, backlog, tâches, sprints ...)\n - contrôles qualité des sources\n - gestion des images Docker\n - gestion des artefacts projets comme, par exemple, les archives de livraison\n - génération et publication automatique de la documentation des projets\n - \"Information radiator\" pour l'affichage sur grands écrans et en continu de\n   l'état des projets\n - suivi des temps\n\nsans oublier les aspects méthodologiques :\n\n - interactions avec le client\n - workflow Git\n - approche ChatOps aussi bien pour une remontée en temps réel des événements du\n   SI que pour l’automatisation de tâches\n - formation des équipes par la mise en place de DevTalks\n\npour finir par une présentation des développements futurs envisagés :\n\n - mise en place d'un portail centralisé d'accès au SI (intégration un tableau\n   de bord par projet et un CMS)\n - outil de tests de perfs\n - meilleure analyse qualité des sources"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Et si la solution, c'était le problème ?",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 341,
"venue_id": "tobedefined",
"speakers": "Arnaud LEMAIRE, ",
"description": "Notre profession aime le challenge : inventer des solutions à des problèmes complexes ! \n\nMais si votre dernière prise de tête sur un code source n'était pas vraiment liée à la difficulté du problème, mais juste au fait que vous ne résolviez pas le bon problème ? \n\nUne ode à la prise de recul avant de foncer tête baissée sur la solution."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Les fausses bonnes idées que j’ai croisé dans ma carrière",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 342,
"venue_id": "tobedefined",
"speakers": "Arnaud LEMAIRE, ",
"description": "On a tous déjà connu ce code qui parait résoudre parfaitement un problème donné, mais qui s'avère être la pire idée du monde quelques semaines ou mois plus tard. \n\nDepuis le début de ma carrière, je note avec attention toutes ces \"fausses bonnes idées\", que j'ai croisé dans les projets sur lesquels j'ai travaillé (et y compris celles dont j'ai été l'auteur). \n\nC'est ce recueil que me propose de parcourir en votre compagnie, à la fois sur des décisions qui ont fait échouer des projets, mais aussi sur des sujets plus légers et parfois amusants."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Philosophie fonctionnelle",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Architecture, Performance et Sécurité",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 343,
"venue_id": "tobedefined",
"speakers": "Arnaud LEMAIRE, ",
"description": "Le paradigme fonctionnel est encore trop souvent considéré à tort comme complexe et reste souvent malheureusement mal compris. \nC’est la raison pour laquelle je vous propose un jeu de questions-réponses pour comprendre le modèle de pensée qui se cache derrière ce terme, afin de vous faire découvrir : \n\n— Une introduction à la pensée fonctionnelle sans utiliser un langage fonctionnel \n— L’utilisation de ce paradigme au quotidien, dans vos développements, en synergie avec d’autres paradigmes \n— Comment il vous permet d’éliminer la majorité des bugs dans vos développements \n— Les quelques réflexes fonctionnels qui améliorent énormément le débogage et la facilité de tester vos applications"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Industrialisation, productivité et complexité : les maux de notre industrie",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Keynote",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 344,
"venue_id": "tobedefined",
"speakers": "Arnaud LEMAIRE, ",
"description": "Notre industrie a toujours cherché à améliorer la productivité du développement, le terme d'industrialisation est apparu, porteur d'espoir : les frameworks ont proliféré... Mais les problèmes sont restés, la situation a même parfois empiré. \n\nEt si nous avions fait fausse route ? Et si à force de chercher une solution \"magique\" nous étions passés à côté de ce qui fait notre métier ?"
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "WebPack, Babel, React & Flux : au-delà des Buzzwords",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Web",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 345,
"venue_id": "tobedefined",
"speakers": "Arnaud LEMAIRE, ",
"description": "Javascript a subi des évolutions massives ces dernières années, au niveau du langage mais aussi des outils. \n\nC'est pourquoi je vous propose un état de l'art du développement en javascript pour 2016 : \n?\tLes bonnes pratiques spécifiques à JavaScript ES6 et la gestion de la rétrocompatibilité de votre code à l’aide de Babel. \n?\tComment simplifier la gestion des packages et le processus de build à l’aide de WebPack (et remplacer Gulp, Grunt & co). \n?\tLe fonctionnement de React et les bonnes pratiques à connaitre pour être efficace dès votre premier projet. \n?\tUne introduction à l’architecture Flux (à l’aide de Redux), pour simplifier la gestion des états au sein d’une UI complexe."
},
{
"event_key": "tobedefined",
"active": "Y",
"name": "Spécifications en milieu agile",
"event_start": "tobedefined",
"event_end": "tobedefined",
"event_type": "Agilité, Méthodologie et Tests",
"seats": "tobedefined",
"goers": "tobedefined",
"invite_only": "N",
"venue": "tobedefined",
"id": 346,
"venue_id": "tobedefined",
"speakers": "Arnaud LEMAIRE, ",
"description": "La question de savoir quoi faire reste un élément indispensable à tout projet !\nMais comment associer spécifications fonctionnelles et techniques dans les méthodologies agiles ?\nComment permettre au client de garder une vision d'ensemble sans être noyé sous le détail ?\n\nEn étudiant les pratiques du user story mapping, de l'impact mapping et de l'event storming, nous verrons comment concilier agilité et vision produit !"
}
]
